pakosep/sepako/stm32f1_blue/doc/main.c
		SysInit();
		#define dly1 0xffffff
		
		
		#ifdef BLACK_Board
		 #define LED PB12_o
		 GPIOB->CRH = (GPIOB->CRH & 0xfff0ffff) | 0x00010000;	// LED Black PB12
		#else
		 #define LED PC13_o
		 GPIOC->CRH = (GPIOC->CRH & 0xff0fffff) | 0x00100000;	// LED Blue  PC13
		#endif
		
		/*
		uint16_t wart[16][16]; //tablica
		wart[5][5] = 15;
		uint16_t *BKPSRAMADDR0 = (uint16_t *)0x40024000UL;//wskaŸnik do pocz¹tku przestrzeni adresowej BACKUP SRAM
		*(BKPSRAMADDR0 + 5) = wart[5][5];
		BKPSRAMADDR0 				= &wart[5][5];
		//wart[licz1][licz2]= *(BKPSRAMADDR0 + licz3);
		*/
		
		Usart1Init(); // Green->PA10, White->PA9 
		head();
		veml6075();
		//ili9486();
		
		//Zegarek();
		//SleepMode(1);
		//uv_meter();
		//wiznet5500();		
		//LoRaTX();
		//LoRaRX();
	}
	
/*== MAIN ===================================================================*/
#define wMOSI							bitband_t m_BITBAND_PERIPH(&GPIOA->ODR, 7)
#define wMISO							bitband_t m_BITBAND_PERIPH(&GPIOA->IDR, 6)
#define wSCK							bitband_t m_BITBAND_PERIPH(&GPIOA->ODR, 5)
#define wCS 							bitband_t m_BITBAND_PERIPH(&GPIOA->ODR, 4)
void testwsk(void){
		
		uint16_t tab1[]={8,513,734,612,87};
		uint8_t  tab2[]={7,99 ,1  ,2  ,113};
		
		uint8_t  * wsk1 = (u08*)tab1;
		uint16_t * wsk2 = (u16*)tab2;
		
		wsk1 += 3;
		wsk2 += 1;
		
		int a = *wsk1;
		int b = *wsk2;
	}

void veml6075(void){
		
		char swh,tbuf[12];
		p_Fifo1->rct=1;	p_Fifo1->rwi=1;	p_Fifo1->rbuf[0]='l';
		u08 sx[8],reg,dat,buf_adr[3],c_adr=0;
		u16 *veml = (u16*)&buf_adr[0];
		
		struct {
			u16 UVA;
			u16 UVB;
			u16 UVD;
			u16 UV1;
			u16 UV2;
			u32 UVI;
			u32 UVAc;
			u32 UVBc;
			
		}uv;
		
		LED=1;
		
		GPIOA->CRH = (GPIOA->CRH & 0x0ff00fff) | 0x10011000;
		GPIOB->CRL = (GPIOB->CRL & 0xfff00fff) | 0x00011000;
		
		oled_hw.sck  = (u32*) m_BITBAND_PERIPH(&GPIOB->ODR,4);
		oled_hw.mosi = (u32*) m_BITBAND_PERIPH(&GPIOB->ODR,3);
		oled_hw.dc   = (u32*) m_BITBAND_PERIPH(&GPIOA->ODR,12);
		oled_hw.cs   = (u32*) m_BITBAND_PERIPH(&GPIOA->ODR,11);
		oled_hw.rst  = (u32*) m_BITBAND_PERIPH(&GPIOA->ODR,15);
		
		sh1106_init();
		
		oled_num24(0,0,"12");
		oled_refresh_gram();
		//ssd1306_init();
		//ssd1306_clear_screen(0x00);
		//ssd1306_refresh_gram();
		
		i2c2_init();
		
		buf_adr[0]=0x0;
		buf_adr[1]=0x10;	// 100ms
		buf_adr[2]=0x0;
		i2c2_write(0x20, buf_adr, 3);
		
		while(1){
			
			if(p_Fifo1->rct){
				UART_getChar( (char*)&swh);
				
				switch (swh)	{
					case 'r':
					//strBlock = UART_getNum();
					UaPutK("\r\n reg = 0x");	reg=UART_getHex();
					UaPutK("\r\n dat = 0x");
					i2c2_read(0x20,reg,buf_adr,2);	hex2uart(*veml,4);
					break;
					case 'w':
					UaPutK("\r\n reg = 0x"); buf_adr[0]=UART_getHex();
					UaPutK("\r\n dt0 = 0x"); buf_adr[1]=UART_getHex();
					UaPutK("\r\n dt1 = 0x"); buf_adr[2]=UART_getHex();
					
					i2c2_write(0x20, buf_adr, 3);
					reg = buf_adr[0];
					UaPutK("\r\n dat = 0x");
					i2c2_read(0x20,reg,buf_adr,2);	hex2uart(*veml,4);
					break;
					case 'c':
					UaPutK("\f");
					UaPutK("\n\r\n======= i2c CS8416 Audio Interface ===============\r\n");
					UaPutK(" r - Read   c - Clear page  \r\n");
					UaPutK(" w - Write  l - Loop read   \r\n");
					UaPutK("==================================================\r\n > ");
					break;
					case 'l':
					//strBlock = UART_getNum();
					UaPutK("oop \r\n");
					do{
						
						if(STCLK_MS*200 < (trg0 - SysTick->VAL)){	
							trg0  = SysTick->VAL;	
							//i2c2_read(0x20,0x07,buf_adr,2);	hex2uart(*veml,4);
							//i2c2_read(0x20,0x09,buf_adr,2);	hex2uart(*veml,4);
							i2c2_read(0x20,0x07,buf_adr,2); uv.UVA=*veml; unt2uart (uv.UVA ,4); UaPutK(",");	//UVA
							i2c2_read(0x20,0x09,buf_adr,2);	uv.UVB=*veml; unt2uart (uv.UVB ,4); UaPutK(",");  //UVB
							i2c2_read(0x20,0x08,buf_adr,2);	uv.UVD=*veml; unt2uart (uv.UVD ,4); UaPutK(",");	//UVD
							i2c2_read(0x20,0x0a,buf_adr,2);	uv.UV1=*veml; unt2uart (uv.UV1 ,4); UaPutK(",");	//UVCMP1
							i2c2_read(0x20,0x0b,buf_adr,2);	uv.UV2=*veml; unt2uart (uv.UV2 ,4); UaPutK(","); //UVCMP2
							
							uv.UVAc = (100*(uv.UVA-uv.UVD)-(333*(uv.UV1-uv.UVD)-250*(uv.UV2-uv.UVD)));
							uv.UVBc = (100*(uv.UVB-uv.UVD)-(366*(uv.UV1-uv.UVD)-275*(uv.UV2-uv.UVD)));
							uv.UVAc /= 100;
							uv.UVBc /= 100;
							//sint2uart (uv.UVAc); UaPutK(",");	
							//sint2uart (uv.UVBc); UaPutK(",");	
							uv.UVI  = ((uv.UVBc*125) + (uv.UVAc*110))/2;
							
							
							//unt2uart (uv.UVI  ,5); UaPutK("\r\n");	
							//num2uart (uv.UVI ,6, 0);
							//sint2uart (uv.UVI); 
							//UaPutK("\r\n");	
							
							int2str(uv.UVA ,tbuf,4,0);		//ssd1306_num24(0, 0,tbuf);
							int2str(uv.UVB ,tbuf,4,0);		//ssd1306_num24(64,0,tbuf);
							int2str(uv.UVI ,tbuf,5,4);		//ssd1306_num24(0,4,tbuf);
							
							//ssd1306_refresh_gram();	
							LED^=1;
							
						}
						
					} 
					//while (!p_Fifo1->rct);
					while (1);
					break;
					
					default:
					UaPutK("\r");
					break;
				}
			}
		}
	}

void Zegarek(void){
		u32 cnt=0,uxt;
		char str_num[10];
		char tbuf[9] ={"00-00-00"};
		char dbuf[11]={"0000-00-00"}; // data
		
		RtcInit();
		
		//ssd1306_init();
		//ssd1306_clear_screen(0x00);
		//ssd1306_str16(0,4,"Zegarek");
		//ssd1306_refresh_gram();
		while(1){
			
			if(STCLK_MS*1000 < (trg0 - SysTick->VAL)){
				trg0  = SysTick->VAL;
				rtc_GetTime(1,&Rtc);
				CopyTime(tbuf,&Rtc);
				CopyDate(dbuf,&Rtc);
				//ssd1306_str16(0,0,num2str(Lp++ ,str_num,5,0));
				//ssd1306_num24(0,0,num2str(Lp++ ,str_num,5,0));
				//uxt = (RTC->CNTH<<16) | RTC->CNTL;
				//ssd1306_str16(0,6,hex2str(uxt,str_num,8));
				
				//ssd1306_num24(0,4,dbuf);
				//ssd1306_num24(0,0,tbuf);
				//ssd1306_refresh_gram();	
			}
		}
	}
uint8_t softSPI_w(uint8_t byte)	{
		uint8_t counter;
		for(counter = 8; counter; counter--)
		{
			if (byte & 0x80)			wMOSI = 1;
			else			wMOSI = 0;
			
			byte <<= 1;
			wSCK = 1; /* a slave latches input data bit */
			Delay_us(10);
			if (wMISO)			byte |= 0x01;
			
			wSCK = 0; /* a slave shifts out next output data bit */
			Delay_us(10);
		}
		return(byte);
	}

uint8_t softSPI_r(uint8_t byte)
	{
		uint8_t counter;
		for(counter = 8; counter; counter--)
		{
			if (byte & 0x80)			wMOSI = 1;
			else				wMOSI = 0;
			
