pakosep/sepako/stm32f1_blue/doc/main.c
			wSCK = 0; /* a slave shifts out output data bit */
			byte <<= 1;
			
			if (wMISO)		byte |= 0x01;
			wSCK = 1; /* a slave latches input data bit */
		}
		return(byte);
	}
void ili9486(void){
		char swh,reg,dat;
		
		p_Fifo1->rct=1;	p_Fifo1->rwi=1;	p_Fifo1->rbuf[0]='c';
		
		GPIOA->CRL = (GPIOA->CRL & 0x0000ffff) | 0x34330000;	//   PA7=MOSI, PA6=MISO, PA5=SCK, PA4=CE 
		
		while(1){
			
			if(p_Fifo1->rct){
				UART_getChar( (char*)&swh);
				
				switch (swh)	{
					case 'r':
					//strBlock = UART_getNum();
					UaPutK("\r\n reg = 0x");	reg=UART_getHex();
					UaPutK("\r\n dat = 0x");
					wCS = 0;		dat = softSPI_r(reg); 	wCS = 1;
					hex2uart(dat,2);
					
					break;
					case 'w':
					wCS = 0;
					for(u08 i=0;i<64;i++){
						hex2uart(softSPI_r(i),2);
					}
					wCS = 1;
					UaPutK("\r\n");
					
					break;
					case 'c':
					UaPutK("\f");
					UaPutK("\n\r\n======= ILI9486 ==================================\r\n");
					UaPutK(" r - Read   c - Clear page  \r\n");
					UaPutK(" w - Write  l - Loop read   \r\n");
					UaPutK("==================================================\r\n > ");
					break;
					default:
					UaPutK("\r");
					break;
				}
			}
		}
		
	}

void wiznet5500(void){
	u16 AMh;
	s16 AMt;
	char strg[10];
	SPI1_init_();
	//GPIOA->CRL = (GPIOA->CRL & 0x000fffff) | 0x54500000;	// PA5~7
	GPIOB->CRL = (GPIOB->CRL & 0xffffff0f) | 0x00000010;	
	GPIOC->CRH = (GPIOC->CRH & 0xf0ffffff) | 0x01000000;	// LED Blue  PC14
	
	DHT_Init();
	//ssd1306_init();
	//ssd1306_clear_screen(0xff);
	//ssd1306_display_string3216(0,32, (const u08*) unt2str(12345678, strg, 8));
	//ssd1306_refresh_gram();
	
	/*
	PB1_o = 1;
	PC14_o = 1;
	PC14_o = 0;	Delay_ms(2);	PC14_o = 1;
	Delay_ms(200);
	PB1_o = 0;
	
	softSPI_w(0x0);
	softSPI_w(0x0);
	softSPI_w(0x0);
	reg=softSPI_w(0x0); 
	*/ 
	
	//spi1_rw(0x0);
	//spi1_rw(0x1);
	//spi1_rw(0x0);
	//reg=spi1_rw(0x0);
	
	
	//UaPutK("\r\n W5500(1)=");
	//uint2uart(reg);
	//ssd1306_display_string    (0,0 , (const u08*)"Temp[C]   Hum[%]", 16, 1);
	//ssd1306_draw_point(0, 8, 1);
	u16 var=1;
	u08 tx[24]={0,1,2,3,4,5,6,7,8,9,8,4,6,8,10,12,14,15,13,12,11,10,9,8};
	//u08  tx[8]={0,1,2,3,4,5,6,7};
	u08 bar[8]={0x1,0x3,0x7,0xf,0x1f,0x3f,0x7f,0xff};
	
	for(u08 n=0;n<24;n++){
		//var = 1<<tx[n];
		//ssd1306_draw_byte(n,7,var>>8);
		//ssd1306_draw_byte(n,6,var&0xff);
		var = 1<<tx[n];
		if(var>255){ 
			//ssd1306_draw_byte(n,7,bar[tx[n]]);
			//ssd1306_draw_byte(n,6,bar[7]);
		}else{
			//ssd1306_draw_byte(n,7,0);
			//ssd1306_draw_byte(n,6,bar[tx[n]]);
		}
		
	} 
	
	//ssd1306_refresh_gram();
	

	
	while(1){
		
		if(STCLK_MS*1000  < (trg0 - SysTick->VAL)){
			trg0 = SysTick->VAL;
			
			if (!(DHT_read( &AMh, &AMt,1,&AM2302_pin)) ){		// AM2302 read T & H
			 	
			} 
			LED^=1;
			
			//ssd1306_display_string3216(0,32, (const u08*) unt2str(AMh, strg, 3));
			//ssd1306_display_string    (0,0 , (const u08*) int2str(AMt, strg, 3,1), 16, 1);
			//ssd1306_display_string    (45,0 , "C", 16, 1);
			
			//ssd1306_display_string    (0 ,16, (const u08*) int2str(AMh, strg, 3,1), 16, 1);
			//ssd1306_display_string    (45,16 , "%", 16, 1);
			//ssd1306_display_string3216(0 ,32,(const u08*) unt2str(AMt, strg, 3));
			//ssd1306_display_string3216(64,32,(const u08*) unt2str(AMh, strg, 3));
			if(flag_9);
			//ssd1306_display_string3216(48,32,(const u08*) ";");
			else
			//ssd1306_display_string3216(48,32,(const u08*) ":");
			flag_9 ^=1;
			
			//ssd1306_refresh_gram();//
		}
	}
	
}
void uv_meter(void){
		
		u16 adc5;
		char strg[10];
		
		GPIOA->CRL = (GPIOA->CRL & 0x000fffff) | 0xaa000000; // ADC12_IN5		
		
		PB10_o = 1;
		LED = 1;
		I2C2_init();
		u08 a[256],b;
		//i2c2_scan(a,&b);
		
		
		ADC1Init();
		ADC1->SQR1 = ( 0<<20 	); 		//length and sequence 12..15 conversion 13-16 on channel	(0..17)
		ADC1->SQR3 = ( 5<<0*5 );		//(channel<<sequence*5) sequence=0..5   
		ADC1->SMPR2 = (4<<5*3 );
		ADC1->CR1 = ADC_CR1_SCAN;			// multi channel mode		
		ADC1->CR2 |= ADC_CR2_ADON ;		// On ADC
		
		//ssd1306_init();
		//ssd1306_clear_screen(0x00);
		//ssd1306_draw_point(10, 10, 0);
		u08 cnt=0;
		
		while(1){
			while(PB0_i==0);
			//ssd1306_display_string3216(0,32, (const u08*) unt2str((cnt++)%20, strg, 2));
			//ssd1306_refresh_gram();
			//i2c2_read( 0x21, 0x0, i2, 2 );
			i2c2_scan(a,&b);
			//ssd1306_display_string3216(48,32, (const u08*) unt2str(b, strg, 2));
			//ssd1306_refresh_gram();
			//if((cnt%10)==0)ssd1306_clear_screen(0xff);
			while(PB0_i==1);
			b=0;
		}
		
		while(1){ 
			for(u08 n=0;n<8;n++){
				ADC1_CR2_ADON = 1;							// start conversion ADC
				//Delay_200n(9);
				Delay_us(10);
				if(ADC1->DR>1180)	adc5 += ADC1->DR-1180 ;
			}
			adc5 /= 8;
			//ssd1306_display_string3216(0,16, (const u08*) uint2str(k++,strg));
			//ssd1306_display_string3216(0,0,(const u08*) unt2str(adc5, strg, 4));
			
			LED = 1;
			//i2c2_read( 0x10, 0x0, i2, 2 );
			LED = 0;
			
			//ssd1306_display_string3216(0,0, (const u08*) unt2str(adc5, strg, 4));
			//ssd1306_display_string    (0,0,(const u08*) unt2str(adc5  , strg, 4),16,1);
			//ssd1306_display_string3216(0,32, (const u08*) unt2str(adc5, strg, 4));
			//ssd1306_display_string3216(0,32, (const u08*) unt2str(b, strg, 4));
			
			//ssd1306_refresh_gram();
			Delay_ms(200);
			//ssd1306_init();
			//test();
			//ssd1306_refresh_gram();
			
		}
	}
void IRQLoraInit	(void)			{
		/*
			Library ST				 Manual RM0008
			AFIO->EXTICR[0] => AFIO_EXTICR1 GPIO 0..3			
			AFIO->EXTICR[1] => AFIO_EXTICR2 GPIO 4..7
			AFIO->EXTICR[2] => AFIO_EXTICR3 GPIO 8..11
			AFIO->EXTICR[3] => AFIO_EXTICR4 GPIO 12..15
			Jednoczeœnie pin moze byc skonfigurowany tylko dla jednego portu
		 */
		AFIO->EXTICR[0] = AFIO_EXTICR1_EXTI0_PB;		// Enable interrupt port PA0
		EXTI->PR   = EXTI_PR_PR0;			// Clear interupt request EXTI0
		EXTI->RTSR 	 = EXTI_RTSR_TR0;
		//EXTI->FTSR 			= EXTI_FTSR_TR6 | EXTI_FTSR_TR0;	// Failing trigger enabled
		EXTI->IMR  =  EXTI_IMR_MR0;		// Interrupt mask register EXTI_IMR
		NVIC_EnableIRQ(EXTI0_IRQn);			
	}
	


void LoRaRX(void){
		// SX1278, 16cm antena 433 MHz https://blog.domski.pl/stm32-hal-driver-for-lora-sx1278-wireless-module/
		char swh;
		u08 reg,dat,sx[5];
		static SX1278_hw_t SX1278_hw1;
		static SX1278_t 	 SX1278_1;
		u16 Lp=0;
		
		//ssd1306_init();
		//ssd1306_clear_screen(0x00);
		p_Fifo1->rct=1;	p_Fifo1->rwi=1;	p_Fifo1->rbuf[0]='0';
		LED=1;
		
