pakosep/sepako/stm32f1_blue/doc/main.c
		// RX
		GPIOB->CRH = (GPIOB->CRH & 0x0000ff00) | 0x43430033;	//   
		SX1278_hw1.mosi = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 12); 
		SX1278_hw1.miso = (u32 *)m_BITBAND_PERIPH(&GPIOB->IDR, 13); 
		SX1278_hw1.sck  = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 14); 
		SX1278_hw1.nss  = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 8); 
		SX1278_hw1.rst  = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 9); 
		SX1278_hw1.dio0 = (u32 *)m_BITBAND_PERIPH(&GPIOB->IDR, 15); 
		
		sx[0]=SX1278_433MHZ;
		sx[1]=SX1278_POWER_11DBM;
		sx[2]=SX1278_LORA_SF_7;
		sx[3]=SX1278_LORA_BW_500KHZ;
		sx[4]=10;
		
		SX1278_1.hw = &SX1278_hw1;			// wybor modulu		
		SX1278_begin(&SX1278_1,sx[0],sx[1],sx[2],sx[3]);
		SX1278_LoRaEntryRx(&SX1278_1, 64, 2000);
		
		int 	message_length=65;		
		static char 	buf_rx[256],str_num[12];
		s16 prssi;
		u32 tim=tim;
		
		flag_9=0;
		
		TIM_start();
		TIM_stop(&tim);				
		UaPutK(" Time=");		uint2uart(tim/TIM_US);			
		//ssd1306_str16(0,0,"gpqxy56");
		
		
		//ssd1306_refresh_gram();
		
		while(1){
			
			if(p_Fifo1->rct){
				UART_getChar( (char*)&swh);
				
				switch (swh)	{
					
					case 'q':
					//strBlock = UART_getNum();
					//*SX1278_hw1.nss = 0;
					UaPutK("\r\n");
					for (u08 n=0;n<0x14;n++){
						dat = SX1278_SPIRead(&SX1278_1, n);
						hex2uart(dat,2);
					}
					break;
					case 'r':
					//strBlock = UART_getNum();
					UaPutK("\r\n Read Reg1=0x");	reg=UART_getHex();
					UaPutK(" Reg1 0x");						hex2uart(reg,2);
					UaPutK("= 0x");						
					dat = SX1278_SPIRead(&SX1278_1, reg);
					hex2uart(dat,2);
					break;
					case 'p':
					UaPutK("\r\n 0-3("); uint2uart(sx[1]);UaPutK(") POWER=");					
					sx[1] = UART_getNum();					
					break;
					case 's':					
					UaPutK("\r\n 0-6("); uint2uart(sx[2]);UaPutK(") SF=");					
					sx[2] = UART_getNum();					
					break;
					case 'b':					
					UaPutK("\r\n 0-9("); uint2uart(sx[3]);UaPutK(") BW=");					
					sx[3] = UART_getNum();					
					break;
					case 'd':					
					UaPutK("\r\n sek("); uint2uart(sx[4]);UaPutK(") Delay=");					
					sx[4] = UART_getNum();					
					break;
					
					default:
					break;
				}
				
				SX1278_begin(&SX1278_1,sx[0],sx[1],sx[2],sx[3]);
				SX1278_LoRaEntryRx(&SX1278_1, 64, 2000);
				
				UaPutK("\r\n Menu > ");
				/*
				if(STCLK_MS*1000 < (trg0 - SysTick->VAL)){
				trg0 = SysTick->VAL;
				LX_RES = 0; Delay_us(10); LX_RES = 1;	// reset
				*/
			}
			
			// ================ Odbior RX ====================
			
			if( *SX1278_hw1.dio0 ){
				 message_length = SX1278_LoRaRxPacket(&SX1278_1);
				if(message_length){
					
					SX1278_read(&SX1278_1, (uint8_t *) buf_rx);
					UaPutK("\r\n prssi->");	
					prssi = SX1278_SPIRead(&SX1278_1, LR_RegPktRssiValue)-164;
					sint2uart(prssi);
					
					//memcpy (UC1608_Buf,' ',150*8);
					
					//ssd1306_str16(0 ,4,int2str(buf_rx[0]+(buf_rx[1]<<8),str_num,3,1));
					//ssd1306_str16(45,4,"%");
					//ssd1306_str16(50,6,num2str(buf_rx[4]+(buf_rx[5]<<8)+(buf_rx[6]<<16),str_num,7,0));
					
					//ssd1306_str16(0 ,6,int2str(buf_rx[2]+(buf_rx[3]<<8),str_num,3,1));
					//ssd1306_str16(45,6,"{");
					//ssd1306_str16(70,4,num2str(-1*prssi ,str_num,3,0));
					
					//ssd1306_refresh_gram();
					
					//UaPutK("' rssi=");		sint2uart(prssi);
					//UaPutK(" pkt_len=");	sint2uart(message_length);
					//UaPutS(".");
					LED ^= 1;
					Lp=0;
			 	} 
			}
			// ================ Odbior RX ====================
			if(STCLK_MS*1000 < (trg0 - SysTick->VAL)){	
				trg0  = SysTick->VAL;	
				//ssd1306_str16(0,0,num2str(Lp++ ,str_num,5,0));
				//ssd1306_num24(0,0,num2str(Lp++ ,str_num,5,0));
				//ssd1306_refresh_gram();
			}
		}
		
	}

void LoRaTX(void){
		// SX1278, 16cm antena 433 MHz https://blog.domski.pl/stm32-hal-driver-for-lora-sx1278-wireless-module/
		
		u08 sx[5];
		static SX1278_hw_t SX1278_hw1;
		static SX1278_t 	 SX1278_1;
		
		
		int 	message_length=65;		
		static char 	buf_tx[10];
		
		u32 tim=tim,alr,cnt=0;
		#define DivSec	16
		
		AM23_hw_t am23;
		//u16 AMh;
		//s16 AMt;
		
		// Low power		
		RtcInit();
		Tim3Init();		
		p_Fifo1->rct=1;	p_Fifo1->rwi=1;	p_Fifo1->rbuf[0]='0';
		
		//TX
		GPIOA->CRL = (GPIOA->CRL & 0xfff00000) | 0x00044343;	//   PA2=MOSI, PA1=MISO, PA0=SCK, PB8=CE PB9=Reset
		GPIOB->CRH = (GPIOB->CRH & 0xffffff00) | 0x00000033;	//   
		SX1278_hw1.mosi = (u32 *)m_BITBAND_PERIPH(&GPIOA->ODR, 2); 
		SX1278_hw1.miso = (u32 *)m_BITBAND_PERIPH(&GPIOA->IDR, 1); 
		SX1278_hw1.sck  = (u32 *)m_BITBAND_PERIPH(&GPIOA->ODR, 0); 
		SX1278_hw1.nss  = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 8); 
		SX1278_hw1.rst  = (u32 *)m_BITBAND_PERIPH(&GPIOB->ODR, 9); 
		SX1278_hw1.dio0 = (u32 *)m_BITBAND_PERIPH(&GPIOB->IDR, 1); 
		
		sx[0] = SX1278_433MHZ;
		sx[1] = SX1278_POWER_11DBM;
		sx[2] = SX1278_LORA_SF_7;
		sx[3] = SX1278_LORA_BW_500KHZ;
		sx[4] = 10; // Przerwa miedzy pomiarami
		
		SX1278_1.hw = &SX1278_hw1;			// wybor modulu		
		SX1278_begin(&SX1278_1,sx[0],sx[1],sx[2],sx[3]);
		
		// Pomiar wilgotnosci i temperatury czujnikiem AM2302
		
		GPIOA->CRH = (GPIOA->CRH & 0x0fffffff) | 0x60000000;
		am23.pin = (u32*) m_BITBAND_PERIPH(&GPIOA->IDR, 15); 
		am23.prt = (u32*) m_BITBAND_PERIPH(&GPIOA->ODR, 15); 
		am23.typ = AM2302;
		
		flag_9 = 0;		
		LED	   = 1;		
		
		GPIOA->CRH = (GPIOA->CRH & 0xfff0f0ff)|0x00020200 ; //low power
		//GPIOA->CRH = (GPIOA->CRH & 0xfff0ffff)|0x00020000 ; 
		GPIOA->ODR = 0b0001010000000000;
		GPIOA->ODR |= (1<<10)|(1<<12); 
		
		//SleepMode(1);
		PWR->CR  |= (PWR_CR_LPDS | PWR_CR_CSBF | PWR_CR_CWUF);  // 
		PWR->CR  &= ~PWR_CR_PDDS;   		
		SCB->SCR |= SCB_SCR_SLEEPDEEP;	
		
		alr = ((RTC->CNTH<<16) | RTC->CNTL) + DivSec*2 ;		
		while(!bRTC_CRL_RTOFF); 			//wait to synchro
		bRTC_CRL_CNF = 1;							//Start edit mode
		RTC->ALRH =  alr >>16;
		RTC->ALRL =  alr & 0xffff;
		//RTC->CRH  |= RTC_CRH_ALRIE; //Interrupt
		//RTC->CRL &= ~RTC_CRL_ALRF;
		RTC->PRLL = 0x8000/DivSec;
		bRTC_CRL_CNF = 0;					  	//End edit mode
		while(!bRTC_CRL_RTOFF); 	  	//wait to synchro
		
		//AFIO->EXTICR[0] = AFIO_EXTICR1_EXTI1_PB;
		AFIO->EXTICR[2] = AFIO_EXTICR3_EXTI10_PA;
		//EXTI->PR   			= EXTI_PR_PR17;	
		EXTI->RTSR 	 		= EXTI_RTSR_TR17 | EXTI_RTSR_TR10 ;
		//EXTI->RTSR 	 		= EXTI_RTSR_TR17  ;
		//EXTI->IMR  			|= EXTI_IMR_MR17;		// Interrupt mask register EXTI_IMR
		EXTI->EMR  			= EXTI_EMR_MR17 | EXTI_EMR_MR10;		  // Event mask register EXTI_EMR
		//EXTI->EMR  			= EXTI_EMR_MR17 ;		  // Event mask register EXTI_EMR
		//NVIC_EnableIRQ(RTCAlarm_IRQn);
		flag_9=1;	
		
		
		while(1){
			
			// ================ Nadawanie TX =================
			
			#ifdef NONE
			/*if(STCLK_MS*500 < (trg0 - SysTick->VAL) && flag_9==0){
			trg0 = SysTick->VAL; */
			if(TIM3_MS*500 < (t3rg0 - TIM3->CNT) && flag_9==0){
			 t3rg0 = TIM3->CNT;
				
				strcpy (buf_tx," ");		
				//strcat (buf_tx,unt2str(tim/TIM_MS,str_num,7));
				strcat (buf_tx,unt2str(n++,str_num,5));
				strcat (buf_tx," ");
				message_length = strlen(buf_tx); 
				
				SX1278_LoRaEntryTx (&SX1278_1, message_length, 2000);
				
				TIM_start();
				// ==== Start transmisji ====
				SX1278_LoRaTxPacketStart(&SX1278_1, (uint8_t *) buf_tx, message_length);  // Start transmisji
				flag_9=1;
				
