pakosep/sepako/stm32f1_blue/doc/main.c
			}
			#endif
			// ==== Koniec transmisji ====
			
			// Obsluga z usypianiem
			
			/*if(TIM3_MS*4000 < (t3rg0 - TIM3->CNT)){	t3rg0 = TIM3->CNT; */
			if(flag_9){
				//LED=0;
				
				TIM_start();
				if(!AM23_read(&am23)){
					
				} 
				
				SX1278_standby(&SX1278_1);
				//strcpy (buf_tx,"H=");
				//strcat (buf_tx,int2str(am23.AMh,str_num,3,1));
				//strcat (buf_tx," T=");
				//strcat (buf_tx,int2str(am23.AMt,str_num,3,1));
				//message_length = strlen(buf_tx); 
				message_length = 7; 
				buf_tx[0]=am23.AMh&0xff;	buf_tx[1]=am23.AMh>>8;
				buf_tx[2]=am23.AMt&0xff;	buf_tx[3]=am23.AMt>>8;
				buf_tx[4]=cnt;		    		buf_tx[5]=cnt>>8;				buf_tx[6]=cnt>>16;
				cnt++;
				
				//UaPutK(" H="); num2uart(am23.AMh,3,1);	
				//UaPutK(" T="); num2uart(am23.AMt,3,1);	
				
				SX1278_LoRaEntryTx (&SX1278_1, message_length, 2000);
				SX1278_LoRaTxPacketStart(&SX1278_1, (uint8_t *) buf_tx, message_length);  // Start transmisji
				
				flag_9 = 0;
				
			}
			
			
			if(*SX1278_hw1.dio0 && flag_9==0 ){
				
				
				SX1278_LoRaTxPacketEnd(&SX1278_1);
				TIM_stop(&tim);				
				//UaPutK("\r\n > TX ");		uint2uart(tim/TIM_MS);			UaPutK("[ms] ");								
				//UaPutK(" Sleep...");
				SX1278_sleep(&SX1278_1);
				tim = RTC->CNTL;
				SysTick->CTRL &= ~SysTick_CTRL_ENABLE; // STOP SysTick
				Delay3_us(50);
				//LED=1;
				
				//Delay3_ms(1000);
				__WFE();
				//__SEV();
				//__WFE();				
				__NOP();				
				
				SysTick->CTRL |= SysTick_CTRL_ENABLE;  // START SysTick
				pll_start(CRYSTAL, F_CPU);				
				
				tim = RTC->CNTL-tim;
				//uxt = (RTC->CNTH<<16) | RTC->CNTL;
				
				alr = ((RTC->CNTH<<16) | RTC->CNTL) + DivSec*sx[4];				
				while(!bRTC_CRL_RTOFF); 	//wait to synchro
				bRTC_CRL_CNF = 1;					//Start edit mode
				RTC->ALRH =  alr >>16;
				RTC->ALRL =  alr & 0xffff;
				//RTC->CRL &= ~RTC_CRL_ALRF;
				bRTC_CRL_CNF = 0;					//End edit mode
				while(!bRTC_CRL_RTOFF); 	//wait to synchro
				//UaPutK(" Wake-Up "); uint2uart((tim*1000)/DivSec);	UaPutK("[ms]");
				
				flag_9 = 1;
			}
			// ================ Nadawanie TX =================
			//if(STCLK_MS*200 < (trg1 - SysTick->VAL) && flag_9==0){
			//trg1 = SysTick->VAL;
			if(TIM3_MS*2000 < (t3rg1 - TIM3->CNT)){
				t3rg1 = TIM3->CNT;
				//uxt = RTC->CNTL+(RTC->CNTH<<16);
				//uint2uart(uxt);
			}
			
		}
	}
void col1(void){
			dma_buf[0]=0xe0;	dma_buf[8]  =0xe0;	dma_buf[16]=0xe0;
			dma_buf[1]=0xe0;	dma_buf[9]  =0xe0;	dma_buf[17]=0xe0;
			dma_buf[2]=0xe0;	dma_buf[10] =0xe0;	dma_buf[18]=0xe0;
			dma_buf[3]=0xe0;	dma_buf[11] =0xe0;	dma_buf[19]=0xe0;
			dma_buf[4]=0xe0;	dma_buf[12] =0xe0;	dma_buf[20]=0xe0;
			dma_buf[5]=0xf8;	dma_buf[13] =0xe0;	dma_buf[21]=0xe0;
			dma_buf[6]=0xf8;	dma_buf[14] =0xe0;	dma_buf[22]=0xe0;
			dma_buf[7]=0xf8;	dma_buf[15] =0xe0;	dma_buf[23]=0xe0;
		}
void col2(void){
			dma_buf[0]=0xe0;	dma_buf[8]  =0xe0;	dma_buf[16]=0xe0;
			dma_buf[1]=0xe0;	dma_buf[9]  =0xe0;	dma_buf[17]=0xe0;
			dma_buf[2]=0xe0;	dma_buf[10] =0xe0;	dma_buf[18]=0xe0;
			dma_buf[3]=0xe0;	dma_buf[11] =0xe0;	dma_buf[19]=0xe0;
			dma_buf[4]=0xe0;	dma_buf[12] =0xe0;	dma_buf[20]=0xe0;
			dma_buf[5]=0xe0;	dma_buf[13] =0xe0;	dma_buf[21]=0xe0;
			dma_buf[6]=0xe0;	dma_buf[14] =0xe0;	dma_buf[22]=0xe0;
			dma_buf[7]=0xe0;	dma_buf[15] =0xe0;	dma_buf[23]=0xe0;
	}	
void col0(void){
			dma_buf[0]=0;	dma_buf[8]  =0x0;	dma_buf[16]=0x0;
			dma_buf[1]=0;	dma_buf[9]  =0x0;	dma_buf[17]=0x0;
			dma_buf[2]=0;	dma_buf[10] =0x0;	dma_buf[18]=0x0;
			dma_buf[3]=0;	dma_buf[11] =0x0;	dma_buf[19]=0x0;
			dma_buf[4]=0;	dma_buf[12] =0x0;	dma_buf[20]=0x0;
			dma_buf[5]=0;	dma_buf[13] =0x0;	dma_buf[21]=0x0;
			dma_buf[6]=0;	dma_buf[14] =0x0;	dma_buf[22]=0x0;
			dma_buf[7]=0;	dma_buf[15] =0x0;	dma_buf[23]=0x0;
	}
void ws2812led(void){
		
		//UaPutK("\f");
		//tr_cls(1);
		
		GPIOA->CRL = (GPIOA->CRL & 0x0000ffff) | 0xBBB30000;	// PA5~7
		
		//GPIOC->CRH = (GPIOC->CRH & 0xfff0ffff) | 0x00010000;	// enc28_CS
		
		RCC->APB2ENR   |= RCC_APB2ENR_SPI1EN;
		//SPI1->CR1 = SPI_CR1_SSM|SPI_CR1_SSI|SPI_CR1_BR_0|SPI_CR1_BR_1|SPI_CR1_BR_2|	SPI_CR1_MSTR;	// 0x037c
		SPI1->CR1 = SPI_CR1_SSM|SPI_CR1_SSI|SPI_CR1_MSTR|SPI_CR1_BR_0|SPI_CR1_BR_1;	// 0x037c
		SPI1->CR2 |= SPI_CR2_TXDMAEN;
		SPI1->CR1 |= SPI_CR1_SPE;		
		
		//---- DMA ----
		uint32_t CCR_reg = 0; 
		
		//memset ( dma_buf, 0xf8, 64 );	// 0xE0=0, 0xf8=1
		//for(i=0;i<4;i++) {
		
		col0();
		
		RCC->AHBENR   			|= RCC_AHBENR_DMA1EN;		// enable clock for DMA1
		DMA1_Channel3->CCR 	= 0;										//Disable channel
		DMA1_Channel3->CMAR = (uint32_t)dma_buf;	 	//Destination address:
		DMA1_Channel3->CPAR = (uint32_t)&SPI1->DR;	//Source PERIPHERAL address:
		//DMA2_Channel1->CNDTR = sizeof(dst_buf);		//Buffor size :
		DMA1_Channel3->CNDTR = 24;		//Buffor size :
		
		//CCR_reg |=  DMA_CCR1_PL;		 		// Priorytet high
		CCR_reg &=  ~DMA_CCR1_MSIZE;	 	// 8bit
		CCR_reg &=  ~DMA_CCR1_PSIZE;	 	// 8bit
		//CCR_reg |=  DMA_CCR1_MSIZE_0 | DMA_CCR1_PSIZE_0;	// 16bit/16bit
		CCR_reg |=  DMA_CCR1_MINC;	 		// Increment memory address enabled
		//CCR_reg |=  DMA_CCR1_PINC;	 	// Increment peripheral address enabled
		CCR_reg |= DMA_CCR1_CIRC;	 			// Mode Circular mode disabled
		CCR_reg |= DMA_CCR1_DIR;		 		// Dir Read from memory
		//CCR_reg |=  DMA_CCR1_TCIE; 		// Transfer complete interrupt enable
		DMA1_Channel3->CCR =  CCR_reg;	
		
		DMA1->IFCR = DMA_IFCR_CGIF3 | DMA_IFCR_CTCIF3;
		DMA1_Channel3->CCR |= DMA_CCR1_EN;
		
		
		UaPutK("\r\n DMA start...");
		u08 fl=0;
		
		while(1){
			
			if(STCLK_MS*100 < (trg0 - SysTick->VAL)){
				trg0 = SysTick->VAL;
			}
			
			if(STCLK_MS*200 < (trg1 - SysTick->VAL)){
				trg1 = SysTick->VAL;
				
				//tr_locate(9,9);
				//UaPutK("Licznik=0x");
				//hex2uart(inc++,4);
				//DMA1_Channel3->CCR 	&= ~DMA_CCR1_EN;
				
				
				//DMA1_Channel3->CCR 	&= ~DMA_CCR1_EN;
				//col0();
				//DMA1_Channel3->CCR |=  DMA_CCR1_EN;
				Delay_us(50);
				
