pakosep/sepako/stm32f1_blue/doc/main.c
				//SPI1->CR1 &= ~SPI_CR1_SPE;		
				//DMA1_Channel3->CCR 	&= ~DMA_CCR1_EN;
				
				if(fl){
					col1();
					fl=0;
				} else {
					col1();
					fl=1;
					LED ^= 1;
				}
				
				Delay_us(260);
				col0();
				
				//SPI1->CR1 |= SPI_CR1_SPE;		
				//DMA1->IFCR = DMA_IFCR_CGIF3 | DMA_IFCR_CTCIF3;
				//DMA1_Channel3->CNDTR = 24;		//Buffor size :
				//DMA1_Channel3->CCR |= DMA_CCR1_EN;
				
				//DMA1_Channel3->CCR |=  DMA_CCR1_EN;
				
				//DMA1_Channel3->CCR |=  DMA_CCR1_EN;
				//PA4_o = 1;
			}
		}
		
		#ifdef NOTUSE
			
			//if(STCLK_MS*5000 < (trg0 - SysTick->VAL)){
			//	trg0 = SysTick->VAL;
			if(TIM3_MS*5000 < (t3rg0 - TIM3->CNT)){
				t3rg0 = TIM3->CNT;
				LED=1;
				UaPutK("\r\n > Sleep");
				Delay3_ms(1);
				__WFI();	
				
				pll_start(CRYSTAL, F_CPU);
				//Delay3_ms(1);
				UaPutK("\r\n > Wake-Up uxt=");
				uxt = RTC->CNTL+(RTC->CNTH<<16);
				uint2uart(uxt);
				//trg0 = SysTick->VAL;
				t3rg0 = TIM3->CNT;
				
			}
			
			if(TIM3_MS*1000 < (t3rg1 - TIM3->CNT)){
				t3rg1 = TIM3->CNT;
				UaPutK(".");
			}
			LED=0;
			//LED=1;
			
			
			//Delay3_ms(1000);
			
			//TIM_stop(&tim);
			//UaPutK("\r\n");
			//uint2uart(tim);
			//hex2uart(tim/TIM_US,5);
			
		#endif
		
	}
void lexmark_lcd(void){
		
		char switcH;
		u32 tim;
				
		
		
		// 0.2703693125
		// 0.2710821250
		//0x57+1,0x58+0,0x05+0
		
		//0x58+0,0x08+0,0x01+0
		//0x58+1,0x08+0,0x01+0
		//0x59+0,0x08+0,0x01+0
		//0x59+1,0x08+0,0x01+0
		//0x5A+0,0x08+0,0x01+0
		//0x5A+1,0x08+0,0x01+0
		//0x5B+0,0x08+0,0x01+0
		//0x5B+1,0x08+0,0x01+0
		
		/*
		for(u32 x=0;x<7700;x++){
			GPIOA->ODR = 0 ;
			Delay_us(1);
			LX_CLK  = 1; Delay_us(1);
			LX_CLK  = 0; Delay_us(2);
		}*/
		
		UC1608_Init();
		
		//GPIOA->ODR =  0xae;		// disable display
		//Delay_us(2);			LX_CLK  = 1; Delay_us(1);			LX_CLK  = 0; Delay_us(3);
		//GPIOA->ODR =  (3<<6)|(32);		// 
		//Delay_us(2);			LX_CLK  = 1; Delay_us(1);			LX_CLK  = 0; Delay_us(3);
		UC1608_Clr();
		
		UC1608_str (0, 0,"Witaj szkolo         ");
		UC1608_str (1, 0,"Zapraszam do pracy        ");
		UC1608_Refresh();
		Delay_ms(1000);
		
		UC1608_str (1, 0,"                          ");
		UC1608_Refresh();
		
		TIM_start();
		//UC1608_Refresh();
		TIM_stop(&tim);
		UaPutS(" T[us]="); sint2uart(tim/TIM_US);
		
		
		while(1){
		
			//UC1608_Cmd(0xae);
			
			//UC1608_Clr();
			//UC1608_Cmd(UC1608_ALL_PIX_ON);
			
			//while(1);
			
			//UC1608_Cmd(UC1608_DISP_OFF);
			//UaPutK("\r\n start ");
			
			
			/*
			for(u08 w=2;w<6;w++){
				UC1608_xy(40, w);
				LX_CD  = 1;
				for(n=0;n<80;n++) UC1608_Data(0xff);	
			} */
			
			//UC1608_Cmd(UC1608_ALL_PIX_OFF);
			//UC1608_Cmd(UC1608_DISP_ON);
			
			//UC1608_Clr();
			
		}
		
		
		//LX_CD  = 0; 
		//GPIOA->ODR =  0xaf;		// enable display
		//Delay_us(2);			LX_CLK  = 1; Delay_us(1);			LX_CLK  = 0; Delay_us(3);
		//LX_CD  = 1;
		
		
		p_Fifo1->rct=1;	p_Fifo1->rwi=1;	p_Fifo1->rbuf[0]='n';
		
		while(1){	
		
			if(p_Fifo1->rct){
				UART_getChar( (char*)&switcH);
				
				switch (switcH)	{
					case 'n':
					//strBlock = UART_getNum();
					
					UaPutK("\r\n set ");
					break;
				}
			}
			
			/*
			if(STCLK_MS*1000 < (trg0 - SysTick->VAL)){
				trg0 = SysTick->VAL;
				LX_RES = 0; Delay_us(10); LX_RES = 1;	// reset
				
			}
			*/
			
			//LX_CLK  = 1; Delay_us(1);
			//LX_CLK  = 0; Delay_us(3);
			//GPIOA->ODR = (GPIOA->ODR & 0xff00 ) | ( 0x00ff & a[n])	;
			//GPIOA->ODR = (a[n]<<1)|b[n] ;
		}
		
	}
void softUTX_init(void){
		#define p_SofTX		bitband_t m_BITBAND_PERIPH(&GPIOC->ODR, 14)	// out Soft UART
		GPIOC->CRH = (GPIOC->CRH & 0xf0ffffff) | 0x01000000;  				// PC14 = softUART
	}
void sofUTX(volatile u08 bTX)	{  /// Sotware Transmit USART Frame [8N1] with TIMER PORTB(2)
		u08  cTX = 1 ;
		//4us Tclk = 250 kbps
		p_SofTX=0;				  //START Bit
		Delay_200n(18);
		while(cTX != 0){		//Wait to send Data
		 if(bTX & cTX)  p_SofTX=1;
		 else 					p_SofTX=0;
		 cTX <<= 1;
		 Delay_200n(18);
		}
		p_SofTX=1;				//STOP Bit		
		Delay_us(10);
	}
void ToLED(u16 B,u16 A,u08 dot)	{
		sofUTX(B&0x00ff);	// segment LO
		sofUTX(B>>8);			// segment HI
		sofUTX(A&0x00ff);	// segment LO
		sofUTX(A>>8);			// segment HI
		sofUTX(dot);
	}

void cmd_LCD(uint8_t byte)	{
		uint8_t counter;
		for(counter = 8; counter; counter--)
		{
			if (byte & 0x80)	sMOSI = 1;
			else							sMOSI = 0;
			byte <<= 1;
			sSCK = 1; /* a slave latches input data bit */
			Delay_us(2);
			sSCK = 0; /* a slave shifts out next output data bit */
			Delay_us(2);
		}
		
	}


u16  CalculateLux(u16 iGain, u16 tInt, u16 ch0, u16 ch1, int iType)	{
		//----------------------------------------------------------------------------
		// first, scale the channel values depending on the gain and integration time 16X, 402mS is nominal.
		// scale if integration time is NOT 402 msec
		
    u32 chScale;
    u32 channel1;
    u32 channel0;
     
    s32 ratio;
    u32 ratio1;
     
    u16 b, m;
     
    s32 temp;
     
    u32 lux;
     
    switch (tInt)
    {
      case 0: // 13.7 msec
       chScale = CHSCALE_TINT0;
      break;
      
      case 1: // 101 msec
       chScale = CHSCALE_TINT1;
      break;
      
      default: // assume no scaling
       chScale = (1 << CH_SCALE);
      break;
    }
		
    // scale if gain is NOT 16X
    if (!iGain) chScale = chScale << 4; // scale 1X to 16X
		
    // scale the channel values
    channel0 = (ch0 * chScale) >> CH_SCALE;
    channel1 = (ch1 * chScale) >> CH_SCALE;
//----------------------------------------------------------------------------

// find the ratio of the channel values (Channel1/Channel0)
// protect against divide by zero
    ratio1 = 0;
    if (channel0 != 0) ratio1 = (channel1 << (RATIO_SCALE+1)) / channel0;

// round the ratio value

    ratio = (ratio1 + 1) >> 1;

// is ratio <= eachBreak ?
    //u16 b, m;
    switch (iType)
    {
      case 0: // T, FN and CL package
        if ((ratio >= 0) && (ratio <= K1T))
           {b=B1T; m=M1T;}
            else if (ratio <= K2T)
                {b=B2T; m=M2T;}
            else if (ratio <= K3T)
                {b=B3T; m=M3T;}
            else if (ratio <= K4T)
                {b=B4T; m=M4T;}
            else if (ratio <= K5T)
                {b=B5T; m=M5T;}
            else if (ratio <= K6T)
                {b=B6T; m=M6T;}
            else if (ratio <= K7T)
            {   b=B7T; m=M7T;}
            else if (ratio > K8T)
                {b=B8T; m=M8T;}
            break;
			
       case 1:// CS package
            if ((ratio >= 0) && (ratio <= K1C))
            {b=B1C; m=M1C;}
            else if (ratio <= K2C)
            {b=B2C; m=M2C;}
            else if (ratio <= K3C)
            {b=B3C; m=M3C;}
            else if (ratio <= K4C)
            {b=B4C; m=M4C;}
            else if (ratio <= K5C)
            {b=B5C; m=M5C;}
            else if (ratio <= K6C)
            {b=B6C; m=M6C;}
            else if (ratio <= K7C)
            {b=B7C; m=M7C;}
            else if (ratio > K8C)
           {b=B8C; m=M8C;}
       break;
			
