pakosep/sepako/stm32f1_blue/doc/main.c
    }
		
    //u32 temp;
    temp = (u32)((channel0 * b) - (channel1 * m));
		
    // do not allow negative lux value
    if (temp < 0) temp = 0;
		
    // round lsb (2^(LUX_SCALE?1))
    temp += (1 << (LUX_SCALE-1));
		
    // strip off fractional portion
    lux = (u16)(temp >> LUX_SCALE);
		
    return(lux);
	}

void TSL2561_i2c(void){
		u08 buf[3];
		u32 tim;
		u16 ch0,ch1,lux=lux;
		
		#define TSL2561_ADR  0x72  // 0x72
		#define TIMING  0x81  
		#define DATA0LOW  0x8C 
		#define DATA0HIGH 0x8D 
		#define DATA1LOW  0x8E 
		#define DATA1HIGH 0x8F
		
		GPIOB->CRH = (GPIOB->CRH & 0xffff00ff) | 0x0000dd00;	// ...009900 PB11=SDA (Open-drain) PB10=SCL(Push-pull),
		
		RCC_APB1ENR_I2C2EN_bb = 1;         	// enable clock for I2C2 module
		I2C2_CR1_SWRST_bb = 1;            	// force software reset of I2C peripheral
		I2C2_CR1_SWRST_bb = 0;
		I2C2->TRISE = 37;               		// limit slope
		//I2C2->CCR = (1<<15) | (F_CPU/(4*400000));   // setup speed (400kHz)
		I2C2->CCR = (F_CPU/(4*400000));             // setup speed (100kHz)
		//I2C2->CCR = (1<<15) | (F_CPU/(4*100000));               			// setup speed (400kHz)
		//I2C2->CCR =  100;               			// setup speed (800kHz)
		I2C2->CR2 = I2C_CR2_FREQ_36MHz;     // config I2C2 module
		I2C2_CR1_PE_bb = 1;               	// enable peripheral
		/*
		i2c2_read(0xd0, 0x05, buf,1 );
		UaPutK("\r\n i2c_DS1207 = 0x");	
		hex2uart(buf[0],2);
		while(1);
		*/
		
		//UaPutK("\r\n  I2C ");	
		//hex2uart(GPIOB->CRH,8);
		
		buf[0]=0x80;
		buf[1]=0x03; 
		i2c2_write(TSL2561_ADR,buf,2); // init control Power UP
		buf[0]=0x81;
		buf[1]=0x02; 
		i2c2_write(TSL2561_ADR,buf,2); // init Timing 
		
		while(1){
			
			
			if(STCLK_MS*300 < (trg0 - SysTick->VAL)){
				trg0 = SysTick->VAL;
				//LED ^= 1;
				
				//i2c2_read(TSL2561_ADR, 0x8a, buf,1 ); // read id
				//hex2uart(buf[0],2);
				
				i2c2_read(TSL2561_ADR, DATA0LOW, buf,2 );
				ch0 = (buf[1]<<8)+buf[0];
				i2c2_read(TSL2561_ADR, DATA1LOW, buf,2 );
				ch1	= (buf[1]<<8)+buf[0];
				//hex2uart(ch0,4);
				//hex2uart(ch1,4);
				//hex2uart(buf[0],2);
				
				lux=CalculateLux(0,2,ch0,ch1,0);
				//UaPutK(" lux=");
				//hex2uart(lux,4);
				//sint2uart(lux);
				//UaPutK(" ");	
				sint2uart(ch0);
				UaPutK(",");	
				sint2uart(ch1);
				UaPutK("\r\n");	
				//printf("%d,%d\r\n",chan0,chan1) SerialPlot
				
				
				//UaPutK("\r\n  I2C ");	
				
				TIM_start();
				//Delay_us(10);
				TIM_stop(&tim);
				//UaPutS("tt="); sint2uart(tim);
				TIM_stop(&tim);
				//UaPutS(" tp="); sint2uart(tim/TIM_US);
				//BLED ^= 1;
			}	
		}
	}

#define MIN(a, b) (((a) < (b)) ? (a) : (b))
#define APDS9960_ADR 0x72  // 0x72

typedef enum {
    /* Acceptable parameters for setMode */
    POWER = 0,
    AMBIENT_LIGHT,
    PROXIMITY,
    WAIT,
    AMBIENT_LIGHT_INT,
    PROXIMITY_INT,
    GESTURE,
    ALL
	} ir_mode_t;

void set_mode( u08 mode, bool enable )	{
		u08 buf[3];
    /* Read current ENABLE register */
		i2c1_read(APDS9960_ADR, APDS9960_ENABLE, buf,1 );
		uint8_t reg_val = buf[0];
		
    if( reg_val == ERROR )
    return;
		
    mode = MIN( mode, ALL );
		
    if( mode == ALL )
    {
      reg_val = 0x00;
      if( enable )
      reg_val = 0x7F;
    } else {
      reg_val &= ~( 1 << mode );
      if( enable )
      reg_val |= ( 1 << mode );
    }
		
    /* Write value back to ENABLE register */
    
		buf[0]=APDS9960_ENABLE;			buf[1]=reg_val; 			i2c1_write(APDS9960_ADR,buf,2); 
	}

void MAX44009_i2c(void){
		u08 buf[10];
		u32 tim,exponent,mantissa,lux;
		u16 ch0,ch1,aR,aG,aB,aC;
		tim=tim;
		
		#define MAX44009_ADR 0x94  // 0x94
		#define TSL2561_ADR  0x72  // 0x72
		
		
		// =========================== I2C2 Init ==============================
		GPIOB->CRH    = (GPIOB->CRH & 0xffff00ff) | 0x0000dd00;	// PB11=SDA (Open-drain) PB10=SCL(Push-pull),
		RCC->APB1ENR |= RCC_APB1ENR_I2C2EN;
		//I2C2->CR1  |= I2C_CR1_SWRST;
		I2C2->TRISE   = 37;               								// limit slope
		//I2C2->CCR = (1<<15) | (F_CPU/(4*400000));   		// setup speed (400kHz)
		I2C2->CR2     = 0;
		I2C2->CCR     = (F_CPU/(4*400000));             	// setup speed (100kHz)
		//I2C2->CR2   = I2C_CR2_FREQ_36MHz;     					// config I2C2 module
		I2C2->CR1    |= I2C_CR1_PE;											  // I2C2 Pheripherial enable
		// =========================== I2C1 Init ==============================
		AFIO->MAPR   |= AFIO_MAPR_I2C1_REMAP;		// Remap TIM3 CH2->PB5
		GPIOB->CRH    = (GPIOB->CRH & 0xffffff00) | 0x000000dd;	// PB9=SDA (Alternate Open-drain) PB8=SCL(Alternate Open-drain),
		RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;
		I2C1->TRISE   = 37;               		// limit slope
		I2C1->CR2     = 0;
		I2C1->CCR     = (F_CPU/(4*400000));   // setup speed (400kHz)
		I2C1->CR1    |= I2C_CR1_PE;						// I2C2 Pheripherial enable
		
		/*
		i2c2_read(0xd0, 0x05, buf,1 );
		UaPutK("\r\n i2c_DS1207 = 0x");	
		hex2uart(buf[0],2);
		while(1);
		*/
		
		//UaPutK("\r\n  I2C ");	
		//hex2uart(GPIOB->CRH,8);
		//# Select configuration register, 0x02(02)
		//#       0x40(64)    Continuous mode, Integration time = 800 ms
		
		// TSL2561_Init
		buf[0]=0x80;
		buf[1]=0x03; 
		//i2c2_write(TSL2561_ADR,buf,2); // init control Power UP
		buf[0]=0x81;
		buf[1]=0x12; 
		//i2c2_write(TSL2561_ADR,buf,2); // init Timing 
		
		// MAX44009_Init
		buf[0]=0x02;
		buf[1]=0x40; 
		i2c2_write(MAX44009_ADR,buf,2); // init control Power UP
		
		/*
		buf[0]=APDS9960_ATIME;			buf[1]=DEFAULT_ATIME; 			i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=APDS9960_ATIME;			buf[1]=APDS9960_WTIME; 			i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=DEFAULT_PROX_PPULSE;	buf[1]=APDS9960_PPULSE; 		i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=DEFAULT_POFFSET_UR;	buf[1]=APDS9960_POFFSET_UR; i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=DEFAULT_POFFSET_DL;	buf[1]=APDS9960_POFFSET_DL; i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=DEFAULT_CONFIG1;			buf[1]=APDS9960_CONFIG1; 		i2c1_write(APDS9960_ADR,buf,2); 
    
		//ir_gesture_set_proximity_gain( DEFAULT_PGAIN );
    //ir_gesture_set_ambient_light_gain( DEFAULT_AGAIN );
		
		buf[0]=DEFAULT_PERS;				buf[1]=APDS9960_PERS; 		i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=DEFAULT_CONFIG2;			buf[1]=APDS9960_CONFIG2; 	i2c1_write(APDS9960_ADR,buf,2); 
		buf[0]=DEFAULT_CONFIG3;			buf[1]=APDS9960_CONFIG3; 	i2c1_write(APDS9960_ADR,buf,2); 
		*/
		
		set_mode( AMBIENT_LIGHT, true );
		//set_mode( POWER, true );
		
		i2c1_read(APDS9960_ADR, APDS9960_ID, buf,1 );
		UaPutK("\r\n APDS9960_ID=0x");	
		hex2uart(buf[0],2);
		
		Delay_ms(200);
		while(1){
			
			
			if(STCLK_MS*100 < (trg0 - SysTick->VAL)){
				trg0 = SysTick->VAL;
				//LED ^= 1;
				UaPutK("\r\n");	
				//i2c2_read(TSL2561_ADR, 0x8a, buf,1 ); // read id
				//hex2uart(buf[0],2);
				
				i2c2_read(MAX44009_ADR, 0x03, buf,2 );
				
				exponent = (buf[0] & 0xF0) >> 4;
				mantissa = ((buf[0] & 0x0F) << 4) | (buf[1] & 0x0F);
				//lux = (1<<exponent) * mantissa * 0.045; // printf("Ambient Light luminance : %.2f lux \n", luminance);
				lux = ((1<<exponent) * mantissa * 45 ) /1000 ;
				//lux = pow(2,exponent) * mantissa * 45;
				
				sint2uart(lux);
				UaPutK(",");	
				//num2uart(lux,7,0);
				i2c2_read(TSL2561_ADR, DATA0LOW, buf,2 );
				ch0 = (buf[1]<<8)+buf[0];
				i2c2_read(TSL2561_ADR, DATA1LOW, buf,2 );
				ch1	= (buf[1]<<8)+buf[0];
				
