pakosep/sepako/stm32f1_blue/doc/main.c
				lux=CalculateLux(1,2,ch0,ch1,0);
				sint2uart(lux);
				
				UaPutC(',');
				
				
				memset ( buf, 1, 10);
				i2c1_read(APDS9960_ADR, 0x94, buf,8 );
				aC = (buf[1]<<8)+buf[0];
				aR = (buf[3]<<8)+buf[2];
				aG = (buf[5]<<8)+buf[4];
				aB = (buf[7]<<8)+buf[6];
				
				sint2uart(aC); UaPutC(','); //hex2uart((buf[1]<<8)+buf[0],4);
				sint2uart(aR); UaPutC(','); //hex2uart((buf[3]<<8)+buf[2],4);
				sint2uart(aG); UaPutC(','); //hex2uart((buf[5]<<8)+buf[4],4);
				sint2uart(aB); UaPutC(',');//hex2uart((buf[7]<<8)+buf[6],4);
				
				
				//i2c1_read(APDS9960_ADR, 0x81, buf,1 );
				//hex2uart(buf[0],2);
				//hex2uart(ch0,4);
				//hex2uart(ch1,4);
				//hex2uart(buf[0],2);
				//printf("%d,%d\r\n",chan0,chan1) SerialPlot
				
			}	
		}
	}

 



void BMP280_i2c(void){
		u08 buf[24];
		u16 dig_T1,dig_P1;
		s16 dig_T2,dig_T3,dig_P2,dig_P3,dig_P4,dig_P5,dig_P6,dig_P7,dig_P8,dig_P9;
		u32 adc_T,var1,var2,t_fine,T,p,adc_P,tim;
		
		#define BMP280_ADR 0xEC
		GPIOB->CRH = (GPIOB->CRH & 0xffff00ff) | 0x0000bf00;	// ...009d00 PB10=SCL(Push-pull),PB11=SDA (Open-drain)
		
		RCC_APB1ENR_I2C2EN_bb = 1;         	// enable clock for I2C2 module
		I2C2_CR1_SWRST_bb = 1;            	// force software reset of I2C peripheral
		I2C2_CR1_SWRST_bb = 0;
		I2C2->TRISE = 37;               		// limit slope
		//I2C2->CCR = (1<<15) | (F_CPU/(4*400000));   // setup speed (400kHz)
		//I2C2->CCR = (F_CPU/(4*100000));             // setup speed (100kHz)
		I2C2->CCR = (1<<15) | 25;               			// setup speed (800kHz)
		I2C2->CR2 = I2C_CR2_FREQ_36MHz;     // config I2C2 module
		I2C2_CR1_PE_bb = 1;               	// enable peripheral
		
		i2c2_read(BMP280_ADR,  0xD0, buf,1 );
		UaPutK("\r\n i2c_BMP280 = 0x");	
		hex2uart(buf[0],2);
		
		// set oversampling and mode
		buf[0]=0xf4;
		buf[1]=0xb7; // 0xb3 0x27
		i2c2_write(BMP280_ADR,buf,2); // set mode
		// filter
		buf[0]=0xf5;
		buf[1]=0x10; // 0x27
		i2c2_write(BMP280_ADR,buf,2); // set mode
		
		i2c2_read(BMP280_ADR,  0x88, buf,6+16 );
		dig_T1 = (u16)(((u16)(buf[1]<<8)) | buf[0]);
		dig_T2 = (s16)((buf[3]<<8) | buf[2]);
		dig_T3 = (s16)((buf[5]<<8) | buf[4]);
		
		dig_P1 = (u16)(((u16)(buf[7]<<8)) | buf[6]);
		dig_P2 = (s16)((buf[9]<<8 ) | buf[8]);
		dig_P3 = (s16)((buf[11]<<8) | buf[10]);
		dig_P4 = (s16)((buf[13]<<8) | buf[12]);
		dig_P5 = (s16)((buf[15]<<8) | buf[14]);
		dig_P6 = (s16)((buf[17]<<8) | buf[16]);
		dig_P7 = (s16)((buf[19]<<8) | buf[18]);
		dig_P8 = (s16)((buf[21]<<8) | buf[20]);
		dig_P9 = (s16)((buf[23]<<8) | buf[22]);
		
		i2c2_read(BMP280_ADR,  0xf4, buf,1 ); hex2uart(buf[0],2);
		i2c2_read(BMP280_ADR,  0xf5, buf,1 ); hex2uart(buf[0],2);
		
		
		while(1){
			
			/*
			if(bit==0){
				pll_start(CRYSTAL, F_CPU);
				bit=1;
			} */
			
			if(STCLK_MS*500 < (trg0 - SysTick->VAL)){
				trg0 = SysTick->VAL;
				
				UaPutK("\r\n BMP280 ");	
				
				//buf[0]=0xf4;
				//buf[1]=0xb3; // 0xb3 0x27
				//i2c2_write(BMP280_ADR,buf,2); // set mode
				
				// Obliczenie temperatury ========================================================//
				i2c2_read(BMP280_ADR,  0xFA, buf,3 );
				
				TIM_start();
				
				adc_T = ( (u32)((u16)((buf[0]) << 8) | buf[1] ) << 4) | ( (buf[2]) >> 4);
				var1 = ((((adc_T>>3)  - ((s32)dig_T1<<1))) * ((s32)dig_T2)) >> 11;
        var2 = (((((adc_T>>4) - ((s32)dig_T1)) * ((adc_T>>4) - ((s32)dig_T1))) >> 12)
				* ((s32)dig_T3))>>14;
        
        t_fine = var1 + var2;
				//T     = (t_fine * 5 + 128) >> 8; // resolution 0.01 C
				//T     = (t_fine*25)/128 +5; 		 // resolution 0.001 C
				T     = (t_fine * 50 + 1280) >> 8; // resolution 0.001 C
				
				//Delay_us(10);
				TIM_stop(&tim);
				UaPutS("tt="); sint2uart(tim);
				
				//sint2uart(adc);
				UaPutK(" T=");	
				num2uart(T,5,3);
				
				// Obliczenie ciœnienia ==========================================================//
				
				i2c2_read(BMP280_ADR,  0xF7, buf,3 );				
				adc_P   = ((u32)((u16)(buf[0] << 8) | buf[1])<<4) | (buf[2]>>4);
				TIM_start();
				
				var1 = (((s32)t_fine)>>1) - 64000UL; 
				var2 = (((var1>>2) * (var1>>2)) >> 11 ) * ((s32)dig_P6); 
				var2 = var2 + ((var1*((s32)dig_P5))<<1); 
				var2 = (var2>>2)+(((s32)dig_P4)<<16); 
				var1 = (((dig_P3 * (((var1>>2) * (var1>>2)) >> 13 )) >> 3) + ((((s32)dig_P2) * var1)>>1))>>18; 
				var1 =((((32768+var1))*((s32)dig_P1))>>15); 
				if (var1 == 0) 
				{ 
					//return 0; // avoid exception caused by division by zero 
					break;
				} else { 
					p = (((u32)(((s32)1048576)-adc_P)-(var2>>12)))*3125; 
					if (p < 0x80000000) { p = (p << 1) / ((u32)var1); 	}  
					else  							{ p = (p 			 /  (u32)var1)*2; } 
					var1 = (((s32)dig_P9) * ((s32)(((p>>3) * (p>>3))>>13)))>>12; 
					var2 = (((s32)(p>>2)) * ((s32)dig_P8))>>13; 
					p = (u32)((s32)p + ((var1 + var2 + dig_P7) >> 4)); 
					p = (p*5)/8;
					p = (p*5)/8;
					UaPutK(" p= ");	
					num2uart(p,9,3);
				}
				
				TIM_stop(&tim);
				UaPutS(" tp="); sint2uart(tim/TIM_US);
				
				//LED ^= 1;
			}
			
			if( STCLK_MS*1000 < (trg1 - SysTick->VAL)){
				trg1 = SysTick->VAL;
			}
			
		}
	}
	
void BMP280_spi(void){
	// MASTER
		/*
		BMP280	I2C		SPI
		SCL  		SCL  	SCK			10k->Vcc
		SDA  		SDA  	MOSI		10k->Vcc
		CSB  		NC		CS			10k->Vcc
		SDO  		ADD  	MISO   	10k->GND
		*/
		GPIOA->CRL = (GPIOA->CRL&0x0000ffff)|0xB4B30000;	// PA4~7
		RCC->APB2ENR   |= RCC_APB2ENR_SPI1EN;
		//SPI1->CR1 = SPI_CR1_SSM|SPI_CR1_SSI|1<<3|SPI_CR1_MSTR;	
		//SPI1->CR1 = SPI_CR1_SSM|SPI_CR1_SSI|7<<3|SPI_CR1_MSTR|SPI_CR1_DFF;		
		SPI1->CR1 = SPI_CR1_SSM|SPI_CR1_SSI|7<<3|SPI_CR1_MSTR|SPI_CR1_CPOL|SPI_CR1_CPHA;		
		//SPI1->CR1 = 														 SPI_CR1_MSTR;		
		//SPI1->CR2 |= SPI_CR2_SSOE;		
		//SPI1->CR2  = 0;			
		SPI1->CR1 |= SPI_CR1_SPE;		
		
		trg0 = SysTick->VAL;		trg1 = SysTick->VAL;		trg2 = SysTick->VAL;
		
		u08 v0,v1;
		u08 value[3],ctrl_meas;
		u32 adc,var1,var2;
		
		u16 dig_T1;
		s16 dig_T2,dig_T3;
		u32 tFine,T;
		
		RX1276_CS1 = 0;
		
