pakosep/sepako/stm32f1_blue/doc/main.c
		spi1_rw(0xE0 & 0x7f);   // reset write
		spi1_rw(0xB6); 			    // reset value
		
		Delay_ms(10);
		
		spi1_rw(0xf4 & 0x7f); 	// Select Control register 
		spi1_rw(0x27); 					// Write  Control register 
		
		
		//spi1_rw(0); // Write  Control register 
		RX1276_CS1 = 1;
		
		
		while(1){
			
			
			if( STCLK_MS*2000 < (trg2 - SysTick->VAL)){
				trg2 = SysTick->VAL;
				//LED ^= 1;
				
				RX1276_CS1 = 0;
				
				spi1_rw(0xF4 & 0x7f); 	// Select Control register 
				spi1_rw(0x27); 					// Write  Control register 
				
				spi1_rw(0xF4);
				ctrl_meas = spi1_rw(0xff);
				
				spi1_rw(0x88);
				v0 = spi1_rw(0xff);
				v1 = spi1_rw(0xff);
				dig_T1 = (u16)(((u16)(v1<<8)) | v0);
				
				spi1_rw(0x8A);
				v0 = spi1_rw(0xff);
				v1 = spi1_rw(0xff);
				dig_T2 = (s16)((v1<<8) | v0);
				
				spi1_rw(0x8C);
				v0 = spi1_rw(0xff);
				v1 = spi1_rw(0xff);
				dig_T3 = (s16)((v1<<8) | v0);
				
				spi1_rw(0xFA);
				value[0] = spi1_rw(0xff);
				value[1] = spi1_rw(0xff);
				value[2] = spi1_rw(0xff);
				
				//spi_dat1 = spi1_rw(0xff);
				//spi_dat0 = spi1_rw(0x0);
				//==Init==//
				
				RX1276_CS1 = 1;
				
				UaPutK("\r\n BMP280T1 = 0x");	
				hex2uart(ctrl_meas,2);
				
				hex2uart(dig_T1,4);
				hex2uart(dig_T2,4);
				hex2uart(dig_T3,4);
				
				//hex2uart(spi_dat0,2);				
				//hex2uart(spi_dat1,2);
				//hex2uart(spi_dat2,2);
				
				
				adc = ( (u32)((u16)((value[0]) << 8) | value[1] ) << 4) | ( (value[2]) >> 4);
				//adc = (( (value[0] << 8) | value[1]) << 4) | ((value[2]) >> 4);
				//adc  =  (u32)(value[0]<<12) | (u16)(value[1]<<4) | (0x0f&(value[2]>>4)) ;
				var1 = ((((adc>>3) - ((s32)dig_T1<<1))) * ((s32)dig_T2)) >> 11;
        var2 = (((((adc>>4) - ((s32)dig_T1)) * ((adc>>4) - ((s32)dig_T1))) >> 12)
				* ((s32)dig_T3))>>14;
        //var2 = ((adc>>4) - ((int32_t)dig_T1));
        //var2 = (((var2 * var2) >> 12) * ((int32_t)dig_T3))>>14;
        tFine = var1 + var2;
				T     = (tFine * 5 + 128) >> 8;
				
				UaPutK(" T=");	
				sint2uart(adc);
				UaPutK(" ");	
				num2uart(T,5,3);
				//UaPutK(" Sleep ");	
				//__WFI();
				//__WFE();
			}
		}
		
	}

void fun_tool(u08 znak,T_SD1 * sda){
	u32 strBlock,tim;
	u08 buffer[512];
	u16 crc16;
	u08 *p_buf;
	static T_RTC datetime;
	*sda = *sda;


	switch(znak){
	//================================================================================
	case 'r':
		UaPutK("\r\n FLASH memory Read = ");
		UaPutK("\r\n FLASH memory Read = ");
		//UaPutK("\r\n sectorNumber =0x");
		strBlock = UART_getNum();
		
		//strBlock=UART_getHex();
		strBlock = strBlock > 254 ? 254 : strBlock;
		UaPutK("\r\n Flash memory Page ="); sint2uart(strBlock);
		strBlock = 0x800*strBlock + 0x08000000;
		//buffer = FLASH_PAGGE_122
		//p_buf = (u08 *) FLASH_PAGGE_120;
		//p_buf = (u08 *) W_FONT_1408;
		//p_buf = (u08 *) buffer;
		p_buf = (u08 *) strBlock;
		if(1){
			//if(disk_read (0,buffer,strBlock,1) == RES_OK ){
			UaPutS("\r\n ");
			
			hex2uart(strBlock, 8);
			for(u08 k=0;k<16;k++){
				hex2uart(k, 2);
			}
			
			UaPutS("\r\n\n ");
			for(u32 i=0;i<2048;i+=32){
				//hex2uart(strBlock*512 + i, 8);	// sd card
				hex2uart(strBlock + i, 8);	// memory
				for(u08 k=0;k<32;k++){
					hex2uart(p_buf[k+i], 2);
				}
				UaPutS("  ");
				for(u08 k=0;k<32;k++){
					if ( p_buf[k+i]<0x20 || p_buf[k+i]>127 ) UaPutC('.');
					else UaPutC(p_buf[k+i]);
				}
				UaPutS("\r\n ");
			}
			
			//*((u32*)p_buf+127) = 0;		// CRC obliczamy bez CRC
			//crc16_spi2((u16*)p_buf,sizeof(ASCII_1408_)/2, &crc16 );
			crc16_spi2((u16*)p_buf,2048, &crc16 );
			UaPutK(" crc = ");	hex2uart(crc16,4);
			
		} else UaPutK("\r\n Read Error !!!");
		break;
		//================================================================================
	case 'w':

		UaPutK("\r\n Flash memory Page = ");
		strBlock = UART_getNum();
		strBlock = strBlock > 254 ? 254 : strBlock;
		strBlock = (u32)(0x800*strBlock + 0x08000000);

		TIM_start();
		EraseFlashPage(strBlock);
		TIM_stop(&tim);
		UaPutS("\r\n Kasowanie pamieci FLASH = "); sint2uart(tim/TIM_US);
		//ProgramFlashFromAddr( (u32)strBlock,(u16*)ASCII_1408,776);
		//TIM_stop(&tim);
		//UaPutK("\r\n Czas zapisu do FLASH = "); sint2uart(tim/TIM_US);

		//sint2uart(sizeof(ASCII_1408_));


		break;
		//================================================================================
	case 'u':
		UaPutK("\r\n Godzina = ");
		datetime.hor = UART_getNum();
		UaPutK("\r\n Minut   = ");
		datetime.min = UART_getNum();
		UaPutK("\r\n Sekunda = ");
		datetime.sec = UART_getNum();

		datetime.yer=2016;	// 1970..2106
		datetime.mon=11;		// 1..12	miesi¹c
		datetime.mdy=18;		// 1..31	dzien miesiaca
		datetime.hor=10;		// 0..23	godzina 24h
		datetime.min=50;		// 0..59	minuta
		datetime.sec=30;		// 0..59	sekunda
		rtc_SetTime(&datetime );
		//UaPutS("\r\n uxt ="); sint2uart(utc);
		//utc = ((RTC->CNTL + (RTC->CNTH<<16)) - Off_TIME)%180;
		//UaPutS("\r\n uxt ="); sint2uart(utc);
		//rtc_GetTime(1, &rtc);

		break;
		//================================================================================
	case 'm' :
		UaPutS("\r\n Read Start !");
		for(u32 n=0;n<125;n++){
			TIM_start();
			//disk_read (0, p_sdbuf, (u32)n, 1);
			TIM_stop(&tim);
			tim = tim/TIM_US;
			//UaPutK("\r\n sd[ms] ");
			if(n%1000==0) UaPutK(".");
			if(tim>1000 || tim<700){ UaPutK("\r\n"); int2uart(n,7,0); int2uart(tim,6,3); }
		}
		UaPutS("\r\n Read Done !");
		break;
		//================================================================================
	case 'c' :
		TFT_Clear(BLACK);
		//ramka();
		UaPutS("\r\n Clear !");
		break;
		//================================================================================
	case 'o':
		UaPutK("Read sector");
		UaPutK("\r\n sectorNumber = ");
		//strBlock = UART_getNum((char *)uaBuf);
		u08 sd_status;
		strBlock=UART_getNum();
		TIM_start();
		//i=SD_readSingleBlock(buffer,strBlock);
		sd_status=mci_read_sect (strBlock,buffer,1);

