pakosep/sepako/stm32f1_blue/doc/main.c
		TIM_stop(&tim);
		if(sd_status){
			UaPutS("\r\n ");

			hex2uart(strBlock, 8);
			for(u08 k=0;k<16;k++){
				hex2uart(k, 2);
			}
			
			UaPutS("\r\n\n ");
			for(u32 i=0;i<512;i+=16){
				hex2uart(strBlock*512 + i, 8);
				for(u08 k=0;k<16;k++){
					hex2uart(buffer[k+i], 2);
				}
				UaPutS("  ");
				for(u08 k=0;k<16;k++){
					if ( buffer[k+i]<0x20 || buffer[k+i]>127 ) UaPutC('.');
					else UaPutC(buffer[k+i]);
				}
				UaPutS("\r\n ");
			}
			UaPutK(" t_rsdio = ");	uint2uart(tim/TIM_US);
			//TIM_start();
			crc16_spi2( (u16*) buffer,256, &crc16 );
			//TIM_stop(&tim);
			UaPutK(" crc = ");	hex2uart(crc16,4);
			//UaPutK(" t_crc = ");	uint2uart(tim/TIM_US);
		
		} else UaPutK("\r\n Read Error !!!");
		break;
		//================================================================================

		//================================================================================
	}
	UaPutS("\r\n ");
}

//=========================================================================================================
static inline __attribute__((always_inline)) void Start_ADC1_J(u16 ndtr){
		ndtr=ndtr;
		//DMA1_Channel1->CNDTR = ndtr;					// Buffor size 
		//TIM3->CR1 |= TIM_CR1_CEN;							// Timer3 start
		TIM4->CR1 |= TIM_CR1_CEN;							// Timer4 start
		///DMA1_Ch1_EN_bb = 1;										// DMA Start
		
		//while(dma_buf[0+10*nADC] == ADC1->DR); 
		///while(!(ADC1->SR & ADC_SR_EOC) );
		
		while(!(DMA1->ISR & DMA_ISR_TCIF1));	// Wait for ending transfer DMA
		DMA1->IFCR = DMA_IFCR_CTCIF1;					// Clear flag
		///DMA1_Ch1_EN_bb = 0;										//DMA Stop
		
		//ADC1_CR2_ADON  = 0;		
		//TIM3->CR1 &= ~TIM_CR1_CEN;						// Timer3 stop
		TIM4->CR1 &= ~TIM_CR1_CEN;						// Timer4 stop
	}
	
static inline __attribute__((always_inline)) void Start_ADC1_DMA1(u16 cndtr){
		DMA1_Channel1->CNDTR = cndtr;	// Buffor size 
		
		ADC1_CR2_ADON  = 1;						// start conversion ADC1
		ADC1_CR2_ADON  = 1;						// start conversion ADC1
		DMA1_Ch1_EN_bb = 1;						// DMA1_CH1 START
		while ( !(DMA1->ISR & DMA_ISR_TCIF1) ){		}	
		DMA1_Ch1_EN_bb = 0;					// DMA1_CH1 STOP
		ADC1_CR2_ADON  = 0;					// stop conversion
		DMA1->IFCR = DMA_IFCR_CGIF1 | DMA_IFCR_CTCIF1;
	}
static inline __attribute__((always_inline)) void Start_ADC1_DMA1_irq(u16 cndtr){
		
		DMA1_Channel1->CNDTR = cndtr;	// Buffor size 
		DMA1_Ch1_EN_bb = 1;						// DMA1_CH1 START
		ADC1_CR2_ADON  = 1;						// start conversion ADC1
		ADC1_CR2_ADON  = 1;						// start conversion ADC1		
		//ADC1_SWSTART = 1;
		
		//ADC1->CR2 |= ADC_CR2_ADON;					// start conversion
		//ADC1->CR2 |= ADC_CR2_ADON;					// start conversion
		
		LED1 = 1;
	}

static inline __attribute__((always_inline)) void rkp(void){
		while(p_Fifo1->rct==0);	
		p_Fifo1->rct--; 
	}

void Intro2(void){	
		#define nMES	1 // Ilosc pomiarow
		
		UaPutS("\r\n Start programu... \r\n"); 
		
		static u08 yb[nMES],yn[nMES],mn[4]={1,1},dl[4]={1,1};
		static u16 val[10],rz[4]={0,0};
		static char tbuf[20]={"0000-00-00 00:00:00"};
		uint32_t tim=0;
		u08 i,p=0;
		u16 x,c_dma1,r_dma_buf,idx,c_num,n1=10,cnt_dma=0;
		char chr,str[3];
		n1=n1;
		#define WID 0	// szerokosc lini wykresu
		
		//=======Punkty graniczne obszaru roboczego wykresu=========
		#undef wXmin 
		#define wXmin		31 				//31 			dolna granica wykresu X
		#undef wXmax
		#define wXmax		(319-1)	  //319-1 	górna granica wykresu X
		#undef wYmin
		#define wYmin		1 				//14 			dolna granica wykresu Y
		#undef wYmax
		#define wYmax		(239-12) 	//240-13 	górna granica wykresu Y
		#undef wXlen
		#define wXlen		((wXmax)-(wXmin)+(1)) //szerokoœæ wykresu 
		
		
		static volatile u16	dma_buf[nMES*(wXlen+1)];	
		
		UaPutS("\r\n Debug0..."); 
		RtcInit();
		rtc_GetTime(1,&Rtc);
		//UaPutS("\r\n Debug1..."); 
		ADC1_DMA_Tim4_Init();
		f7_dma1 = 0;
		//UaPutS("\r\n Debug2..."); 
		
		//DACDmaInit();
		//Mem2MemDMAInit(ad1_buf, dma_buf);
		
		
		/*
		TIM_start();
		for(u16 n=0;n<100;n++){
			//TFT_dy( n, dma_buf[1+n*4], dma_buf[1+(n+1)*4],WHITE,0);
			TFT_dy( 3*n, 120, 120+n	,WHITE,0);
			TFT_dy( 3*n, 119, 119-n	,WHITE,0);
		}
		TIM_stop(&tim);
		UaPutS("\r\n TIM= ");
		num2uart(tim/TIM_US,8, 0); 
		
		while(1);
		*/
		
		TFT_Fill(wXmin-1,wYmin-1,wXmax+1,wYmin-1,DGRAY);	// pozioma dolna
		TFT_Fill(wXmin-1,wYmax+1,wXmax+1,wYmax+1,DGRAY);	// pozioma górna
		TFT_Fill(wXmin-1,wYmin-1,wXmin-1,wYmax+1,DGRAY);	// pionowa lewa
		TFT_Fill(wXmax+1,wYmin-1,wXmax+1,wYmax+1,DGRAY);	// pionowa prawa
		
		u08 f=nMES;
		while(f--){
			yb[f] =wYmin;	
			yn[f] =wYmin;
		}
		
		/*
		u08 dl=240;
		for(n=0;n<wXlen;n++){
			
			if(dl==10) dl = n+50;
			else 			 dl = 10;
			if(n>5 && n<10) dl=100;
			
			dma_buf[1+n*nMES] = dl; 			
		} */
		
		//UaPutS("\r\n wXlen="); //sint2uart(wXlen);
		//for(u08 n=0;n<20;n++){ sint2uart(dma_buf[n]);		}
		UaPutS("\r\n wXlen ");	sint2uart(wXlen); 
		
		DMA1_Channel1->CMAR = (uint32_t)dma_buf;	 	//Destination address:
		DMA1_Channel1->CNDTR = wXlen*nMES;					//Buffor size 
		NVIC_EnableIRQ(DMA1_Channel1_IRQn);				  //DMA1 Channel1 IRQ
		//DMA1_Ch1_EN_bb = 1;												//DMA1_CH1 START
		///DMA1_Channel1->CCR |= DMA_CCR1_EN;				  //DMA1_CH1 START
		///TIM4->CR1 |= TIM_CR1_CEN;										// Timer4 start
		
		//Delay_ms(60);					// czas na wypelnienie bufora
		TIM4->PSC   = BKP->DR41; //1000-1
		TIM4->ARR   = BKP->DR42; //1200-1
		
		//c=DMA1_Channel1->CNDTR/nMES;
		
		/*
		UaPutS("\r\n c1=");	sint2uart(DMA1_Channel1->CNDTR/nMES);
		UaPutS("\r\n wXlen="); //sint2uart(wXlen);
		for(u08 n=0;n<200;n++){	sint2uart(dma_buf[n]);		}
		UaPutS("\r\n c2=");	sint2uart(DMA1_Channel1->CNDTR/nMES);
		*/
		//rkp();
		
		for(u16 i=0;i<wXlen;i++){
			//dma_buf[wXlen-i]=i*10;
			
			dma_buf[i]=0x10;
		}
		
		while(1){
			
			if( STCLK_MS*BKP->DR41 < (trg0 - SysTick->VAL) ){
				trg0 = SysTick->VAL;
				cnt_dma=(cnt_dma+1)%wXlen;
				dma_buf[cnt_dma]=0x1;
				
			}
			
