pakosep/sepako/stm32f1_blue/doc/main.c
					SPI1->CR1 &= ~SPI_CR1_CRCEN; // Reset CRC
					SPI1->CR1 |=  SPI_CR1_CRCEN;
					
					TIM_start();
						SPI2CS = 0;
						spi2_rw(0x03);				// Read data
						spi2_rw(addr>>16);
						spi2_rw(addr>>8);
						spi2_rw(addr);
						ID=0;
						tout=0;
						
						while (addr<to_addr){
							//crc_dat = (spi2_rw(0x00)<<8) + spi2_rw(0x00);
							spi1_rw(spi2_rw(0x00) + (spi2_rw(0x00)<<8));
							
							addr    += 2;
							if(!(addr%0x40000)) UaPutC('.');
						}
						
						SPI2CS = 1;
						TIM_stop(&tim);
						crc16 = SPI1->TXCRCR;
						//crc16_spi1_init();
						
						UaPutK("\r\n sum = ");	hex2uart(tout,8);
						UaPutK(" crc16 = ");	hex2uart(crc16,4);
						//crc16_spi2_init();
						//crc16_spi2( (u16*) buffer,256, &crc16 );
						//crc16_spi1( (u16*) buffer,256, &crc16 );
						//SPI2_init();
						//UaPutK(" crc16 = ");	hex2uart(crc16,4);
						
						UaPutK("Tim[us] = ");	uint2uart(tim/TIM_US);
						// CRC16 = 0xdc9e, CRCEN25QH64 = 0cdc9e
						
				break;
				case 'C':	// ==================== Check CRC memory ======================
					UaPutK("Read memory from addr = 0x");
					addr=UART_getHex();
					UaPutK("\r\n Read memory to   addr = 0x");
					to_addr=UART_getHex();
					UaPutK("\r\n ");
					
					SPI1->CR1 &= ~SPI_CR1_CRCEN; // Reset CRC
					SPI1->CR1 |=  SPI_CR1_CRCEN;
					
					TIM_start();
						
						ID=0;
						tout=0;
						
						while (addr<to_addr){
							if(!SD_readSingleBlock(buffer,addr)){
								cdata = (u16*) buffer;
								for (u16 n=0;n<256;n++){
									//spi1_rw((u16)buffer[n*2]);
									spi1_rw(*cdata++);
								}
							} else {
								UaPutK("\r\n Blad odczytu karty SD ");
								break;
							}
							addr++;
							if((addr%512)==0) UaPutC('.');
							
						}	
						
						TIM_stop(&tim);
						crc16 = SPI1->TXCRCR;
						
						
						UaPutK("\r\n sum = ");	hex2uart(tout,8);
						UaPutK(" crc16 = ");	hex2uart(crc16,4);
						UaPutK("Tim[us] = ");	uint2uart(tim/TIM_US);
						// CRC16 = 0xdc9e, CRCEN25QH64 = 0cdc9e
						
				break;
				case 'r':	//===================== Read memory ===========================
					ID=0;
					UaPutK("Read memory addr = 0x");
					addr=UART_getHex();
					
					TIM_start();
						SPI2CS = 0;
						spi2_rw(0x03);				// Read data
						spi2_rw(addr>>16);
						spi2_rw(addr>>8);
						spi2_rw(addr);
						for (u16 n=0;n<512;n++){
							buffer[n]=spi2_rw(0x00); 
						}
						SPI2CS = 1;
						TIM_stop(&tim);
						
						if(1){
							UaPutS("\r\n ");
							hex2uart(addr, 8);
							for(u08 k=0;k<16;k++){
								hex2uart(k, 2);
							}
							UaPutS("\r\n\n ");
							for(u32 i=0;i<512;i+=16){
								hex2uart(addr + i, 8);
								for(u08 k=0;k<16;k++){
									hex2uart(buffer[k+i], 2);
								}
								UaPutS("  ");
								for(u08 k=0;k<16;k++){
									if ( buffer[k+i]<0x20 || buffer[k+i]>126 ) UaPutC('.');
									else UaPutC(buffer[k+i]);
								}
								UaPutS("\r\n ");
							}
							crc16_spi2_init();
							crc16_spi2( (u16*) buffer,256, &crc16 );
							UaPutK(" crc16 = ");	hex2uart(crc16,4);
							SPI2_init();
							
							UaPutK("Tim[us] = ");	uint2uart(tim/TIM_US);
							//TIM_start();
							//TIM_stop(&tim);
							
						} 
				break;
				case 't':
					UaPutK("Test \r\n Pasuja = ");
					addr = 0xff;
					while(addr &  0b011010){
						//if(addr & 0b00111100) hex2uart(addr,2);
						hex2uart(addr,2);
						addr = addr-1; 
						
					}
				break;
				case 'w': //=================== Write memory ============================
						
						UaPutK("Write memory addr = 0x");
						addr=UART_getHex();
						UaPutK("\r\n Write memory data = 0x");
						data=UART_getHex();
						
						TIM_start();
						for(u16 x=0;x<0x2;x++){
							SPI2CS = 0; spi2_rw(0x06);	SPI2CS = 1;			// WREN
							
							SPI2CS = 0;
							spi2_rw(0x02);				// write enab data
							spi2_rw(addr>>16);
							spi2_rw(addr>>8);
							spi2_rw(0);
							
							for (u16 n=0;n<256;n++){
								spi2_rw(data); 
							}
							SPI2CS = 1;
							
							SPI2CS = 0; 
							spi2_rw(0x05);						// Read status register
							tout = 0xffff;
							while(spi2_rw(0x00) & 0xff){	// Write in progress
								sr = spi2_rw(0x00);
								if(!tout--) {
									UaPutK(" Error writing ");
									UaPutK(" SR = ");	hex2uart(spi2_rw(0x00),2);
									SPI2CS = 1;			
									break;
								}
								Delay_ms(1);
							}
							//Delay_us(2000);
							
							SPI2CS = 1;			
							addr += 256;
						}
						
						TIM_stop(&tim);
						
						UaPutK("\r\n Tim[us] = ");	uint2uart(tim/TIM_US);
						UaPutK("\r\n SR = ");hex2uart(sr,2);
						
				break;
				case 'e':	//====================== erase block =========================
						
						UaPutK("Erase memory block(0-0x7f) = 0x");
						addr=UART_getHex();
						
						SPI2CS = 0; spi2_rw(0x06);	SPI2CS = 1;			// WREN
						TIM_start();
						SPI2CS = 0;
						spi2_rw(0xd8);				// 0xd8 Erase Block (0xffff bytes)
						spi2_rw(addr<<16);
						spi2_rw(00);
						spi2_rw(00);	
						SPI2CS = 1;
						
						SPI2CS = 0; 
						spi2_rw(0x05);						// Read status register
						tout = 0xffff;
						while(spi2_rw(0x00) & 0xff){	// erase in progress
							if(!tout--) break;
							Delay_ms(1);
						}
						UaPutK(" SR = ");	hex2uart(spi2_rw(0x00),2);
						SPI2CS = 1;			
						TIM_stop(&tim);
						
						UaPutK("\r\n Tim[us] = ");	uint2uart(tim/TIM_US);
				break;
				case 'E':	//======================= erase all ==========================
						UaPutK("Erase All... ");
						TIM_start();
						SPI2CS = 0; spi2_rw(0x06);	SPI2CS = 1;			// WREN
						SPI2CS = 0; spi2_rw(0xc7);	SPI2CS = 1;			// Erase All
						
						
						SPI2CS = 0; 
						spi2_rw(0x05);						// Read status register
						tout = 0xfffff;
						while(spi2_rw(0x00) & 0xff){	// erase in progress
							if(!tout--) {
								UaPutK(" Error erasing");
								break;
							}
							Delay_ms(10);
							if((tout%1024==0)) hex2uart(tout,5);
						}
						UaPutK(" SR = ");	hex2uart(spi2_rw(0x00),2);
						SPI2CS = 1;			
						TIM_stop(&tim);
						
						UaPutK("\r\n Tim[us] = ");	uint2uart(tim/TIM_US);
				break;
				case 'p':	//======================= Program from SD Card =================
					addr = 0;
					//for(u32 i=0;i<16;i++){
					for(u32 i=0;i<16384;i++){
						if(!SD_readSingleBlock(buffer,i)){
						for(u08 q=0;q<2;q++){
							SPI2CS = 0; spi2_rw(0x06);	SPI2CS = 1;			// WREN
							SPI2CS = 0;
							spi2_rw(0x02);				// write enab data
							spi2_rw(addr>>16);
							spi2_rw(addr>>8);
							spi2_rw(addr);
							
							for (u16 n=0;n<256;n++){
								spi2_rw(buffer[256*q+n]); 
							}
							SPI2CS = 1;
							
							SPI2CS = 0; 
							spi2_rw(0x05);						// Read status register
							tout = 0xffff;
							while(spi2_rw(0x00) & 0xff){	// Write in progress
								Delay_ms(1);
								if(!tout--){
									UaPutK("\r\n Error Programming ");
									break;
								}
							}
							SPI2CS = 1;
							
