pakosep/sepako/stm32f1_blue/doc/main.c
							addr += 256;
						}						
						
						if((i%256)==0) UaPutC('.');
						
					} else UaPutK("\r\n Error Reading SD Card ");
				}
				break;
			}
		}
	}
#endif
void Menu1(void) 		{
	UaPutK("\n\r\n======= STM32F4 SD/MMC Card ======================\r\n");
	UaPutK(" i - Init      r - Read  sector  e - Erase sector   \r\n");
	UaPutK(" d - Delete    f - Write sector  s - Statistic Card \r\n");
	UaPutK(" m - Modf mem  c - Copy  sector  n - Next Cluster  \r\n");
	UaPutK("==================================================\r\n > ");
}
void MemCard_Menu(void){
	u32 strBlock,dstBlock,StrBlock,d,tim;
	s32 numClus=numClus,lenBlock;
	u08 switcH,znak;
	u16 crc=1,x=0,y1=0,y2=0;
	MMCFG mmcfg;
	TFT_Init();
	TFT_Clear(BLACK);

	//u32 * ptrlB = &lenBlock;
	//unsigned char __attribute__((unused)) option, data;
	static u08 buffer[512*16],dinit;
	//crc16_spi2_init();
	//dinit=disk_init(0);
	//dinit=mci_init();
	
	crc16_spi2_init();

	if(dinit){
		UaPutK("\r\nSD Card Init = "); sint2uart(CardType);
	} else UaPutK("\r\nSD Card Init ERROR ");

	p_Fifo1->rct=1;	p_Fifo1->rwi=1;	p_Fifo1->rbuf[0]='i';
	for(;;)
	{
		Menu1();
		while(!p_Fifo1->rct);
		//if(p_Fifo1->rct){	// Wywolanie interfejsu szeregowego gdy odebrano znak

		UART_getChar((char*)&switcH);
		//UaPutC('\f');
		UaPutK("\r\n ");
		switch (switcH)	{
		//========== Init Card SD/MMC ==================================
		case 'i':
			
			dinit=mci_init();
			if(dinit){
				if(	mci_read_config (&mmcfg)){
					UaPutK("\r\nSD Card ser_num    = "); uint2uart(mmcfg.sernum);
					UaPutK("\r\nSD Card block_num  = "); uint2uart(mmcfg.blocknr);
					UaPutK("\r\nSD Card read_blen  = "); uint2uart(mmcfg.read_blen);
					UaPutK("\r\nSD Card write_blen = "); uint2uart(mmcfg.write_blen);
				}
			} else UaPutK("\r\nSD Card Init ERROR ");
			/*
			dinit=disk_init(0);
			if(dinit){
				UaPutK("\r\nSD Card Init = "); sint2uart(CardType);
			} else UaPutK("\r\nSD Card Init ERROR ");
			*/
			break;
			//========== Card Info =========================================
		case 's':
			UaPutK("Statistic Card  ");
			if(dinit){
				//disk_ioctl(0,GET_SECTOR_SIZE ,&lenBlock); UaPutK("\r\n SECTOR_SIZE      = "); uint2uart((u16)lenBlock);
				//if(disk_ioctl(0,GET_SECTOR_COUNT,&numBlock) == RES_OK) { UaPutK("\r\n SECTOR_COUNT     = 0x"); hex2uart(numBlock,7);	   }
				//if(disk_ioctl(0,GET_BLOCK_SIZE  ,&strBlock) == RES_OK) { UaPutS("\r\n ERASE_BLOCK_SIZE = ");   uint2uart((u16)strBlock); }
				//UaPutS("\r\n CARD_SIZE [KB]   = "); uint2uart( (u16)lenBlock*((numBlock/1024)) );
				if(	mci_read_config (&mmcfg)){
					UaPutK("\r\nSD Card ser_num    = "); uint2uart(mmcfg.sernum);
					UaPutK("\r\nSD Card block_num  = "); uint2uart(mmcfg.blocknr);
					UaPutK("\r\nSD Card read_blen  = "); uint2uart(mmcfg.read_blen);
					UaPutK("\r\nSD Card write_blen = "); uint2uart(mmcfg.write_blen);
				}
			}else UaPutK("\r\nSD Card Not Init");
			break;
			//========== Write block ========================================
		case 'f':
			UaPutK("Fill sector");
			UaPutK("\r\n Start Block  = 0x");		strBlock=UART_getHex();
			//strBlock = UART_getNum((char *)uaBuf);
			UaPutK("\r\n End   Blocks = 0x");		dstBlock=UART_getHex();
			dstBlock = dstBlock > strBlock ? dstBlock - strBlock + 1 : 1;
			//dstBlock = dstBlock - strBlock + 1;
			UaPutK("\r\n Num Blocks   = ");				uint2uart(dstBlock);
			UaPutK("\r\n Data to fill = 0x");
			znak=UART_getHex();
			for(u32 i=0;i<512;i++){
				buffer[i] = znak;
			}
			while(dstBlock--){
				TIM_start();
				//i = SD_writeSingleBlock(buffer,strBlock);
				d = mci_write_sect(strBlock, buffer, 1);
				if(d==0) {
					UaPutS("\r\n Fill error = 0x");
					hex2uart(strBlock,8); hex2uart(d,2);
				}
				else {
					if(!(strBlock%1024)){
						TIM_stop(&tim);
						UaPutS("\r\n Fill OK ");
						hex2uart(strBlock,  8);
						UaPutS(" Time[us] = " );
						num2uart(tim, 8,0);
					}
				}
				strBlock++;
			}
			break;
			//========== Modify Memory =====================================
		case 'm':

			UaPutS("Modify memory");
			UaPutS("\r\n Memory Addr = 0x");

			strBlock=UART_getHex();
			//if (SD_readSingleBlock(buffer, strBlock/512) == 0){
			if (mci_read_sect	(strBlock/512, buffer, 1)){
				UaPutS("\r\n Memory Data = 0x");
				hex2uart(buffer[strBlock%512], 2);
				UaPutS("\r\n New Data    = 0x");
				StrBlock=UART_getHex();
				buffer[strBlock%512] = StrBlock;
				//if (SD_writeSingleBlock(buffer,strBlock/512) == 0 ) UaPutS("\r\n Modify OK");
				if (mci_write_sect		(strBlock/512, buffer,1))  UaPutS("\r\n Modify OK");
			}
			break;
			//========== Copy Memory =======================================
		case 'c':
			UaPutK("Copy memory");
			UaPutK("\r\n Src Mem adr = 0x");	strBlock=UART_getHex();
			UaPutK("\r\n How many byte = ");	lenBlock=UART_getNum();
			UaPutK("\r\n Dst mem adr = 0x");	dstBlock=UART_getHex();
			
			u32 dbl = dstBlock%512, sBlk=strBlock/512, sMem=strBlock%512;
			for(u32 bl=(dstBlock/512);bl <= ((dstBlock+lenBlock-1)/512); bl++){
				if (mci_read_sect(bl,buffer,1)){
					UaPutK("\r\n ReadB 0x");							hex2uart(sBlk++,3);
					UaPutC(',');													hex2uart(sBlk, 	3);
					UaPutK("  From 0x");							    hex2uart(sMem, 	3);
					sMem = sMem + (0x200-dbl);
					UaPutK("->0x");											  hex2uart(sMem + (0x200-dbl), 3);
					UaPutK("  WriteB 0x");								hex2uart(bl, 		3);
					UaPutK("  0x");					  						hex2uart(dbl, 	3);
					UaPutK("->0x");
					if (bl == ((dstBlock+lenBlock)/512))	hex2uart((dstBlock+lenBlock)%512, 3);		//Last block
					else																	hex2uart(0x200, 3);
					dbl = 0;
				}
			}
			/*
					if (SD_readSingleBlock( strBlock) == 0){				
						UaPutS("\r\n Dst Block = ");
						strBlock = UART_getNum((char *)uaBuf);
						if (SD_writeSingleBlock(strBlock) == 0 ) UaPutS("\r\n Copy OK");
					}
			 */
			break;
			//========== Read sector =======================================
		case 'r':
			UaPutK("Read sector");
			UaPutK("\r\n sectorNumber = 0x");
			//strBlock = UART_getNum((char *)uaBuf);
			strBlock=UART_getHex();
			TIM_start();
			//d=SD_readSingleBlock(buffer,strBlock);
			d=mci_read_sect (strBlock,buffer,1);
			TIM_stop(&tim);
			if(d){
				UaPutS("\r\n ");
				hex2uart(strBlock, 8);
				for(u08 k=0;k<16;k++){
					hex2uart(k, 2);
				}
				UaPutS("\r\n\n ");
				for(u32 i=0;i<512;i+=16){
					hex2uart(strBlock*512 + i, 8);
					for(u08 k=0;k<16;k++){
						hex2uart(buffer[k+i], 2);
					}
					UaPutS("  ");
					for(u08 k=0;k<16;k++){
						if ( buffer[k+i]<0x20 || buffer[k+i]>126 ) UaPutC('.');
						else UaPutC(buffer[k+i]);
					}
					UaPutS("\r\n ");
				}
				UaPutK(" t_rsdio = ");	uint2uart(tim/TIM_US);
				TIM_start();
				crc16_spi2( (u16*) buffer,256, &crc );
				//crc8_spi2((u08 *) buffer,512,&crc );
				TIM_stop(&tim);
				UaPutK(" crc = ");	hex2uart(crc,4);
				UaPutK(" t_crc = ");	uint2uart(tim/TIM_US);
			} else { 
				UaPutK("\r\n Read Error = ");
				uint2uart(d);
			}
			break;
			//========== Read sector =======================================
		case 'R':
			if(CardType){
				UaPutK("Read multi sector");
				//UaPutK("\r\n Start Sector = 0x");		strBlock=UART_getHex();
				//UaPutK("\r\n End   Sector = 0x");		dstBlock=UART_getHex();
				strBlock = 0;
				dstBlock = 1000000;
				dstBlock = dstBlock > strBlock ? dstBlock - strBlock + 1 : 1;
				UaPutK("\r\n Num Sectors  = ");			uint2uart(dstBlock);
				x=0;
				TFT_Clear(BLACK);
				while(dstBlock--){
					//i = SD_readSingleBlock(buffer,strBlock);
					d = mci_read_sect (strBlock,buffer,1);
					if(!d) {
						UaPutS("\r\n Read error = 0x");
						hex2uart(strBlock,8); hex2uart(d,2);
						break;
					}
					else {
						if(!(strBlock%256)){
							TIM_stop(&tim);
							if(!(strBlock%4096)){
								UaPutS("\r\n Read OK ");
								hex2uart(strBlock,  8);
								UaPutS(" y2 = " );
								uint2uart(y1); UaPutS("\t" ); uint2uart(y2);
								//y2 = (tim-421235)/1024;
							}
							TIM_start();
							y2 = tim/(3*TIM_MS);
							if(x){
								TFT_dy( x, y1, y2, YELLOW, 0);
								//TFT_dy( x, 0, 10, YELLOW, 1);
							}else {
								TFT_Clear(BLACK);
							}
							y1=y2;
							x = (x+1)%(wXmax-wXmin);
						}
					}
					strBlock++;
					if(p_Fifo1->rct) break;
				}
			} else UaPutK("\r\nSD Card Init ERROR ");
			break;
			//========== Last use sector ===================================
		case 'u':
			UaPutK("View last sector");
			UaPutK("\r\n First Sector = 0x");
			strBlock=UART_getHex();
			UaPutK("\r\n Searching ");
			numClus =  1;
			lenBlock = 1;
			//#define _USE_ADD 1
#define _USE_LINEAR 1

#if _USE_LINEAR
			do{
				//if( SD_readSingleBlock(buffer,strBlock++) ) {
				if( mci_read_sect (strBlock++,buffer,1) ) {
					UaPutK("\r\n Exit Read Error !!!");
					break;
				}
				else {
					//for(u32 i=0;i<512;i++)	numClus += buffer[i];
					//crc16_spi2((u16*)buffer,256,&crc);
					if(!(strBlock%1024)) UaPutC('.');
				}
			}
			while(crc != 0x822d );
#endif
#if _USE_ADD
			for(;;){
				if( SD_readSingleBlock(buffer,strBlock)  ) {
					UaPutK("\r\n Exit Read Error !!!");
					break;
				}
				else{
					crc16_spi2((u16*)buffer,256,&crc);
					if(crc == 0x822d){
						lenBlock += numClus;
						if(!(strBlock%0x200)) UaPutC('+');
						strBlock += lenBlock;
						//UaPutK("\r\n Find Sector =+ 0x");	hex2uart(strBlock, 8);
						//UaPutK("\r\n     lenBlock=+ ");		sint2uart(lenBlock);
						if( lenBlock < 0 ) break;						// srodek przedzialu
					}
					else{
						numClus = -1;
						lenBlock += numClus;
						if(!(strBlock%0x200)) UaPutC('-');
						strBlock -= lenBlock;
						//UaPutK("\r\n Find Sector =- 0x");	hex2uart(strBlock, 8);
						//UaPutK("\r\n     lenBlock=- ");		sint2uart(lenBlock);
					}
				}
			}
#endif

