pakosep/sepako/stm32f1_blue/doc/main.c
			UaPutS("\r\n Reg(");
			hex2uart(reg,2);
			UaPutS(") = 0x");
			hex2uart(data,2);
			for (int i=0;i<8;i++){
				UaPutC(' ');
				hex2uart((data&0x80)>>7,1);
				data <<= 1;
			}
			UaPutS("\r\n                7 6 5 4 3 2 1 0");
			//GUI_Text(250,220, int2str(reg,tbuf,4,0),WHITE,BLACK);
		}
		void WriteNRF(void)		{
			u08 reg,data,dat;
			//char tbuf[16];
			UaPutS("\r\n Reg = 0x");
			reg = str2hex((char *)u1buf);
			UaPutS("\r\n Dat = 0x");
			dat = str2hex((char *)u1buf);
			//if (NCE == 1) nce=1;	CE_LOW();
			data = nRF24_writeReg(reg, dat);
			// if (nce)	CE_HIGH();
			UaPutS("\r\n Sts = 0x");
			hex2uart(data,2);
			//GUI_Text(250,220, int2str(reg,tbuf,4,0),WHITE,BLACK);
		}
		void MultiNRF(void)		{
			u08 reg,cnt,ci;
			u08 data[5];
			//char tbuf[16];
			UaPutS("\r\n RegAdr  = 0x");
			reg = str2hex((char *)u1buf);
			UaPutS("\r\n RegCnt  = 0x");
			cnt = str2hex((char *)u1buf);
			nRF24_readBuf(reg, data, cnt);
			UaPutS("\r\n Reg(");
			hex2uart(reg,2);
			UaPutS(") = 0x");
			for(ci=0;ci<cnt;ci++){
				hex2uart(data[ci],2);
				UaPutC(' ');
			}
		}
		/*===========================================================================*/
		void Menu(void) 			{
			UaPutS("\n\r\n==== ARM-STM32 ======================\r\n");
			UaPutS(" r - Read   o - RX_mode	 m - Mult_rd  \r\n");
			UaPutS(" w - Write  n - TX_mode	 s - Reset  ");
			UaPutS("\r\n=====================================\r\n# ");
		}
		void OtherTest(void)	{
		#define DIVADC 4
			u16 dx = 0, navg = DIVADC, Tadc[321];
			u32 tlo=0;
			flag = 0; tX = 4; tY = 120;
			
			//u16 col = TFT_BGR2RGB(YELLOW);
			//u16 col = RGB565CONVERT( 0,255 ,0 );	
			ptm.tm_sec = 59;
			while(0)	/// Oscyloskop
			{						
				tlo = BKP->DR1 | (BKP->DR2 << 16);
				bTIM6_CR1_CEN = 1;
				if(dx == 320) {
					dx = 0;
					TFT_Clear(BLACK);
				}
				
				//==========================================================================
				Tim6 = 0;	TIM6->CNT = 0;
				//==========================================================================
				//LED1 = 1;				
				//Delay1us(tlo);
				//Delay_us(tlo);	
				//TFT_Clear(BLACK);							//16007 us
				//while(dx++<240)		TFT_DrawPoint(dx/120,dx,col);
				//TFT_DrawLine(10,0,11,dy,col);				
				//TFT_DrawVerLine(dx++,dy,adc,BLACK);
				navg = 0;
				while(navg++ < 320){
					//TFT_ShortLine(navg,Tadc[navg-1],Tadc[navg],BLACK);
				}
				//==========================================================================	
				Time6 = ((TIM6->CNT | (Tim6 << 16))*5)/18;		
				//==========================================================================
				navg = 0;
				while(navg++ < 320){
					ADC1_CR2_ADON = 1;					// start conversion ADC PA3
					while(!ADC1_SR_EOC);				// wait for the end of convertion
					Tadc[navg-1]= ADC1->DR/16 ;
				}
				Tadc[0] = Tadc[0];
				navg = 0;
				while(navg++ < 320){
					//TFT_ShortLine(navg,Tadc[navg-1],Tadc[navg],YELLOW);
				}
				//adc = (adc/DIVADC - BKP->DR4);
				//navg = DIVADC;
				//TFT_DrawPoint(dx++,adc,YELLOW);		
				//TFT_DrawVerLine(dx,dy,    adc,YELLOW);
				//TFT_DrawVerLine(dx,dy+1,adc+1,YELLOW);
				//TFT_DrawVerLine(dx,dy+2,adc+2,YELLOW);
				//dx++;
				LED1 = 0;				
				bTIM6_CR1_CEN = 0;
				
				GUI_Text(250,220, int2str(ADC1->DR,tbuf,7,0),0xffff,BLACK);			
				GUI_Text(250,200,int2str(Time6,tbuf,6,1),0xffff,BLACK); 
				Delay_ms(BKP->DR3);
				//TFT_DrawLine(10,0,11,dy,BLACK);				
				//dy = BKP->DR3;
				//GUI_Text(10,10,tbuf,0xffff,BLACK);	
			}
			
			while(0) /// TFT demo
			{
				TFT_Clear(tlo);
				TFT_WriteScaledText( unt2str(tlo,tbuf,5), 100, 100, 4, 4, WHITE, tlo);
				tlo += 1;
				Delay_ms(10);
			}
			
			//u32 licz=8;
			u32 baf[321];
			u16 x;
			while(0)  //Oscyloskop
			{
				for(x=0;x<320;x++)
				{
					//		y=10*sqrt(x);
					/*		do{ licz--;
						bADC1_CR2_ADON = 1;					// start conversion ADC
						while(!bADC1_SR_EOC);				// wait for the end of convertion
						Pom += ADC1->DR;
						}
						while(licz); */
					ADC1_CR2_ADON = 1;					// start conversion ADC
					while(!ADC1_SR_EOC);				// wait for the end of convertion
					baf[x] = ADC1->DR /18 ;
					//	baf[x] = 120+120*sin((float)x/20) ;
					//	LED1 = ~LED1;
				}
				//TFT_Clear(BLACK);
				TFT_Clear(BKP->DR39);
				for(x=1;x<320;x++)
				{
					// TFT_DrawLine(x-1,baf[x-1],x,baf[x],BKP->DR39); //Drow activ line
					// TFT_DrawPoint(x,baf[x],YELLOW);
				}
				Delay_ms(100);
				for(x=1;x<320;x++)
				{
					TFT_DrawLine(x-1,baf[x-1],x,baf[x],0x07ff); //Drow mask line
				}	//		Delay(0,400);
			}
			x=0;
			//TFT_WriteScaledText( unt2str(x,tbuf,5), 0, 0, 2, 3, YELLOW, BLACK);	
			
			while(0)  /// Przesuwajacy sie liczby
			{
				//if(flag & 0b10) { ClockGraph(); flag &= ~(0b10); }
				//I2C2_READ_REG(0, nc++,&data, 1 ); //adr, reg_adr, data, len
				Delay_ms (50);  //type=1 ms, =0 us
				TFT_WriteScaledText( unt2str(x,tbuf,5), x, x, 2, 3, YELLOW, BLACK);
				x += 1;
				if(x>240) x=0;
			}
		}
		void nrf24con(void)		{
			
			void reset(void){
				GPIOA->BSRR = (1<<0);			// Power OFF
				Delay_ms(500);
				GPIOA->BRR  = (1<<0);			// Power ON
			}
			
			void CX(void){
				RX_Mode();
				u08 out_rf;
				u32 cnt=0;
				for (int ch=0; ch<128; ch++){
					nRF24_writeReg(RF_CH, ch);
					CE_HIGH();
					Delay_us(350);
					while( cnt<0xfff ){
						nRF24_readBuf(CD, &out_rf, 1);
						if (out_rf > 0){
							UaPutS("\r\n Carrier ON channel = 0x");
							hex2uart(ch,2);
							cnt=0xffe;
						}
						cnt++;
					}
					cnt=0;
					CE_LOW();
					Delay_us(150);
				}
			}
			
			u08 rx_buf[TX_PLOAD_WIDTH+1];
			void RX(void){
				RX_Mode();
				u08 sts=0,st=0;
				UaPutS("\r\n RX Mode ");
				//nRF24_writeReg(CONFIG, 0x0f);
				while(1){
					CE_HIGH();
					Delay_us(130);
					do
					{
						nRF24_readBuf(STATUS, &sts, 1);
					}while ((sts & RX_DR) == 0);
					CE_LOW();
					nRF24_readBuf(RD_RX_PLOAD, rx_buf, TX_PLOAD_WIDTH);
					//nRF24_writeReg(FLUSH_RX, 0x0);
					UaPutS("\r\n Reg(");
					hex2uart(st++,2);
					UaPutS(") = ");
					UaPutS((char *)rx_buf);
					UaPutC(' ');
					hex2uart(sts,2);
					//for(st=0;st<TX_PLOAD_WIDTH;st++){	hex2uart(rx_buf[st],2);		UaPutC(' ');}
					//Delay_us(150);
					nRF24_writeReg(STATUS, sts);
					Delay_us(10);
					
					//do{	nRF24_readBuf(STATUS, &sts, 1); }while(sts & RX_DR);
					//TIM6->CNT = 0;
					//UaPutS("\r\n TimDelay = ");
					//UaPutS(int2str(Tim6_,tbuf,6,1));
					//Tim6_ = ((TIM6->CNT)*5)/18;
					//hex2uart(Tim6_,4);
				}
			}
			
			while(1)
			{
				Menu();
				UaPutC('\f');
				switch (u1buf[0])			{
				case 'r': ReadNRF();			break;
				case 'w': WriteNRF();			break;
				case 'm': MultiNRF();			break;
				case 'o': RX();						break;
				case 'c': CX();						break;
				case 's': reset();				break;
				case 'n': TX_Mode();		break;
				case 'x': RX_Mode();			break;
				case 'z': OtherTest();		break;
				default: 									break;
				}
			}
			
