pakosep/sepako/stm32f1_blue/doc/main.c
		}
		void Console(void)		{
			u32 licz;
			volatile int Pom,Pom_=0,dY,cR,cG,cB,cC;
			//time_T UnixTime;
			u16 x=0;
			//  char tbuf[16];
			//  char cbuf[20];
			UaPutS("\f ");
			UaPutS("\r\n Start terminala  \r\n");
			// GPIOB->BSRR = (1<<1)|(1<<(0+16));
			UaPutS(" Compilation = ");
			uint2uart(BKP->DR42);
			//	int2str(BKP->DR42,tbuf);
			//	UaPutS(tbuf);
			int test;
			//	char *dczas = cbuf;
			cR=cG=0;
			cB=0;
			while(1) 
			{
				//	count = count_max;		do{count --;}while(count);
				//	UaPutC(0x0C);
				//	ADC1->CR2 |= ADC_CR2_ADON;			// start convertion
				//	while(!(ADC1->SR & ADC_SR_EOC));	// wait for the end of convertion
				Pom = 0;
				UaPutS("\f Time 32 ADC conversion = ");
				//	TIM6->PSC = 36;
				//	TIM6->CNT = 0;
				//	TIM6->CR1 |= TIM_CR1_CEN;
				//	uint2uart(TIM6->CNT);
				do{ licz--;
				ADC1_CR2_ADON = 1;					// start conversion ADC
				while(!ADC1_SR_EOC);				// wait for the end of convertion
				Pom += ADC1->DR;
				}
				while(licz);
				UaPutC(' ');
				//	uint2uart(TIM6->CNT);
				licz = 2;
				Pom = 100;
				Delay_ms(100);
				//		UaPutS("\f ADC = ");
				//		UaPutS(int2str(Pom,tbuf));
				UaPutC(' ');

				UaPutS("\r\n R+ = ");
				for(int i=0;i<32;i++){	// R+
					cR = i;
					cC = torgb(cR,cG,cB);
					TFT_Clear(cC);
					uint2uart(cC);
					Delay_ms(Pom);
				}
				UaPutS("\r\n RB- = ");
				for(int i=31;i>=0;i--){	//B-
					cB = i;
					cC = torgb(cR,cG,cB);
					TFT_Clear(cC);
					uint2uart(cC);
					Delay_ms(Pom);
				}
				UaPutS("\r\n RG+ = ");
				for(int i=0;i<64;i+=2){	//RG+
					cG = i;
					cC = torgb(cR,cG,cB);
					TFT_Clear(cC);
					uint2uart(cC);
					Delay_ms(Pom);
				}
				UaPutS("\r\n -RG = ");
				for(int i=31;i>=0;i--){	//-RG
					cR = i;
					cG = 63;
					cC = torgb(cR,cG,cB);
					TFT_Clear(cC);
					uint2uart(cC);
					Delay_ms(Pom);
				}
				UaPutS("\r\n GB+ = ");
				for(int i=0;i<32;i++){	//GB+
					cB = i;
					cC = torgb(cR,cG,cB);
					TFT_Clear(cC);
					uint2uart(cC);
					Delay_ms(Pom);
				}
				UaPutS("\r\n G-B = ");
				for(int i=63;i>=0;i-=2){	//G-B
					cG = i;
					cC = torgb(cR,cG,cB);
					TFT_Clear(cC);
					uint2uart(cC);
					Delay_ms(Pom);
				}
				
				//Rysuje wykres
				if(Pom-Pom_>0) 			dY=1;
				else if(Pom-Pom_==0)	dY=0;
				else 					dY=-1;
				do{
					TFT_DrawPoint(x,Pom_-16,torgb(Pom/8,Pom/4,Pom/8));
					//	TFT_Clear(torgb(Pom/8,Pom/4,Pom/8));
					Pom_ += dY;
				}
				while(Pom != Pom_);
				x++;
				if(x>320){
					TFT_Clear(BLACK);
					x=0;
				}
				
				/*
				UnixTime = RTC->CNTL + (RTC->CNTH<<16);
					gmtime_r (&UnixTime, &ptm);
				memcpy(dczas,"1982-01-01 11:4::10",20);
				memcpy(dczas,int2str(ptm.tm_year,tbuf),4); dczas += 5;
				memcpy(dczas,int2str(ptm.tm_mon,tbuf),2);  dczas += 3;
				memcpy(dczas,int2str(ptm.tm_mday,tbuf),2); dczas += 3;
				memcpy(dczas,int2str(ptm.tm_hour,tbuf),2); dczas += 3;
				memcpy(dczas,int2str(ptm.tm_min,tbuf),2);  
				if(ptm.tm_min > 9) dczas += 3; else dczas += 2;
				memcpy(dczas,int2str(ptm.tm_sec,tbuf),2);
				dczas = (char *)cbuf;
				UaPutS(cbuf);
				 */
				/*
				UaPutS(int2str(ptm.tm_year,tbuf));			UaPutC('-');
				UaPutS(int2str(ptm.tm_mon,tbuf));			UaPutC('-');
				UaPutS(int2str(ptm.tm_mday,tbuf));			UaPutC(' ');
				UaPutS(int2str(ptm.tm_hour,tbuf));			UaPutC(':');
				UaPutS(int2str(ptm.tm_min,tbuf));			UaPutC(':');
				UaPutS(int2str(ptm.tm_sec,tbuf));
				 */
				
				if(0) 
				{
					if(flag == 1)
					{
						UaPutS("\r\n Out = ");
						test = str2hex((char *)u1buf);
						//UaPutS(int2str(test,tbuf));
						UaPutC(test);
						//	UaPutS(int2str(str2int((char *)u1buf,(int *)test),tbuf));
						UaPutS("\r\n In  = ");
						flag = 0;
						memset((char *)u1buf,0,RBUF_SIZE);
					}
				}
			}
		}
		void Grfaphics(void)	{  // Rozne efekty graficzne
			u16 color=320;
			float a,x,y,x1=0,y1=120;
			
			TFT_Clear(BLACK);
			
			// 	TFT_SetWindows(50,50,100,100);
			// 	GUI_Text(0,0,"DEF",WHITE,RED);
			
			for (x=0;x<320;x++) {		/// demo 2 - rosnace sinusy
				y = x*sin((float)x/20)/4 + 120;
				TFT_DrawLine(x1,y1,x,y,RED);
				TFT_DrawLine(x1+50,y1,x+50,y,GREEN);
				TFT_DrawLine(x1+20,y1,x+20,y,BLUE);
				TFT_DrawPoint(x+10,y+10,YELLOW);
				TFT_DrawPoint(x+10,y+11,YELLOW);
				x1=x; y1=y;
			}
			//TFT_DrawLine(0, 0, 200, 200,GREEN);
			while(1);
		}
		void ClockGraph(void)	{
			time_T UnixTime;
			char tbuf[16];
			char *dczas = cbuf;
			if(ptm.tm_sec == 59){
				UnixTime = RTC->CNTL + (RTC->CNTH<<16);
				gmtime_r (&UnixTime, &ptm);
				//	GUI_Text(tX,tY,cbuf,BLACK,BLACK);
				memcpy(dczas,unt2str(ptm.tm_year,tbuf,4),4); dczas += 5;
				memcpy(dczas,unt2str(ptm.tm_mon,tbuf,2),2);  dczas += 3;
				memcpy(dczas,unt2str(ptm.tm_mday,tbuf,2),2); dczas += 3;
				memcpy(dczas,unt2str(ptm.tm_hour,tbuf,2),2); dczas += 3;
				memcpy(dczas,unt2str(ptm.tm_min,tbuf,2),2);  dczas += 3;
				memcpy(dczas,unt2str(ptm.tm_sec,tbuf,2),2);
			}
			else {
				ptm.tm_sec += 1;
				dczas += 17;
				memcpy(dczas,unt2str(ptm.tm_sec,tbuf,2),2);
			}
			dczas = (char *)cbuf;
			//	GUI_Text(tX,tY,dczas,YELLOW,BLACK);
			GUI_SclText(dczas, tX, tY + 40, 1, 2,YELLOW, BLACK);
			TFT_WriteScaledText(dczas, tX, tY, 1, 2, GREEN, BLACK);
		}
		u16  torgb(u08 R,u08 G,u08 B){
			bColor = B + (G<<5) + (R<<11);
			return bColor;
		}
	

void buble(u16* nodeX, int nodes) {
			/* Sort the nodes, via a simple "Bubble" sort. */
			u16 i = 0,swap;
			while (i < nodes-1)
			{
				if (nodeX[i]>nodeX[i+1])
				{
					swap = nodeX[i];
					nodeX[i] = nodeX[i+1];
					nodeX[i+1] = swap;
					if(i) { i--; }
				}
				else { i++; }
			}
		}
		

void TPD_window(u08 px, u08 py, u16 color){
		char str[10];
		
		//TFT_Fill(64*px+dm,64*py-8+dm,px*64+64-dm,py*64+64-8-dm,color);
		//TFT_txt(int2str(px,str,1,0),64*px+32,64*py+32, color);
		
		//TFT_Fill(40*px+2,40*py+2,px*40+38,py*40+38,color);
		TFT_txt (int2str(px,str,1,0),40*px+15,40*py+15, color);
		
