pakosep/sepako/stm32f1_blue/doc/main.c
	}

void TPDraw(void)			{  // rysuj na panelu dotykowym
			u32 Tx,Ty,px,py;
			char str[10];
			u08 lf1_tpirq=0;
			
			
			px = 0;
			py = 0;
			#define sp1	8
			
			Touch_Init();											
			//bublesort(tpY, 4);
			
			TFT_Clear(BLACK);
			for (u08 n=0;n<9;n++){
				
				TFT_Fill(n*40==320?319:n*40,0,n*40==320?319:n*40 ,239,YELLOW);
				
			}
			
			for(u08 n=0;n<7;n++){
			
				TFT_Fill(0,n*40==240?239:n*40,319,n*40==240?239:n*40,YELLOW);
			}
			
			for(u08 x=0;x<8;x++){
				for(u08 y=0;y<6;y++){
					TFT_txt(int2str(x,str,1,0),40*x+15,40*y+15, YELLOW);
				}
			}
			
			while(1){
				
				if(f1_tpirq){
					trg3 		   = SysTick->VAL;			// set timeout flag
					
					
					px = 0;
					py = 0;
					
					for(u16 x=0; x<8; x++){
						Read_ADS1(&Ty,&Tx); 
						px += Tx;
						py += Ty;
						//TFT_dy (x ,Py ,py ,GREEN,0 ); // Rysuj punkt wykresy
					}
					px /=8;
					py /=8;
					
					px = 350 - ((17*px)/(182));	
					py = 260 - ((17*py)/(252));
					
					px /= 40;
					py /= 40;
					
					f1_tpirq 	= 0;
					lf1_tpirq = 1;
					
					if((px < 8) && (py < 6)) {
						UaPutS("\r\n");
						sint2uart(px); sint2uart(py); 
						
						TPD_window( px, py, BLACK);
						//TFT_Fill(64*px+dms,64*py-8+dms,px*64+64-dms,py*64+64-8-dms,GREEN);
					}
				}
				
				if(lf1_tpirq && (STCLK_MS*300 < (trg3 - SysTick->VAL)))		{ // timeout repeat touchpad
					LED2 = 0;
					bbEXTI_FTSR_6 	= 1;						// Enabled failing triger 
					lf1_tpirq 		 	= 0;
					
					//TFT_Fill(64*px+dms,64*py-8+dms,px*64+64-dms,py*64+64-8-dms,BLACK);
					TPD_window( px, py, GREEN);
					
				}
			}
			
			
		}
#endif
//============================================================================
// IRQ Handler
//============================================================================
void CopyClock(char *dczas, T_RTC *lrtc)			{
		char tbuf[5];
		//u32 utc = RTC->CNTL + (RTC->CNTH<<16);
		//rtc_unix2time (utc, rtc);
		//rtc_GetTime(0, lrtc);
		//char tbuf[20]={"00:00:00 0000-00-00"};
		dczas += 0;	memcpy(dczas,unt2str(lrtc->yer,tbuf,4) ,4);
		dczas += 5; memcpy(dczas,unt2str(lrtc->mon,tbuf,2) ,2);
		dczas += 3; memcpy(dczas,unt2str(lrtc->mdy,tbuf,2) ,2);
		dczas += 3; memcpy(dczas,unt2str(lrtc->hor,tbuf,2) ,2);
		dczas += 3; memcpy(dczas,unt2str(lrtc->min,tbuf,2) ,2);
		dczas += 3; memcpy(dczas,unt2str(lrtc->sec,tbuf,2) ,2);
		
	}
void CopyTime(char *dczas, T_RTC *lrtc)				{
		char tbuf[2];
		//rtc_GetTime(0, lrtc);
		//rtc_GetTim2(0, lrtc);
		
		dczas += 0; memcpy(dczas,unt2str(lrtc->hor,tbuf,2) ,2);
		dczas += 3; memcpy(dczas,unt2str(lrtc->min,tbuf,2) ,2);
		dczas += 3; memcpy(dczas,unt2str(lrtc->sec,tbuf,2) ,2);
	}
void CopyDate(char *dczas, T_RTC *lrtc)				{
		char tbuf[5];
		//rtc_GetTime(0, lrtc);
		dczas += 0;	memcpy(dczas,unt2str(lrtc->yer,tbuf,4) ,4);
		dczas += 5; memcpy(dczas,unt2str(lrtc->mon,tbuf,2) ,2);
		dczas += 3; memcpy(dczas,unt2str(lrtc->mdy,tbuf,2) ,2);
	}
void ExtIInit				(void)			{
		/*
			Library ST				 Manual RM0008
			AFIO->EXTICR[0] => AFIO_EXTICR1 GPIO 0..3			
			AFIO->EXTICR[1] => AFIO_EXTICR2 GPIO 4..7
			AFIO->EXTICR[2] => AFIO_EXTICR3 GPIO 8..11
			AFIO->EXTICR[3] => AFIO_EXTICR4 GPIO 12..15
			Jednoczeœnie pin moze byc skonfigurowany tylko dla jednego portu
		 */
		// These bits is software to select the source input for EXTIx external interrupt.
		
		//AFIO->EXTICR[0] = AFIO_EXTICR1_EXTI0_PE;		// Enable interrupt port PE
		//AFIO->EXTICR[1] = AFIO_EXTICR2_EXTI6_PB;		// Enable interrupt port PB
		AFIO->EXTICR[0] = AFIO_EXTICR1_EXTI3_PA;			// Enable interrupt port PA
		//AFIO->EXTICR[1] = AFIO_EXTICR2_EXTI4_PA;		// Enable interrupt port PA
		//EXTI->PR   = EXTI_PR_PR4;			// Clear interupt request EXTI
		// Interrupt Mask on line x
		// EXTI->PR = EXTI_PR_PR6;		// Clear interupt request EXTI
		//EXTI->PR   = EXTI_PR_PR4;			// Clear interupt request EXTI
		
		// Rising trigger event configuration bit of line x
		// EXTI->RTSR 			|= EXTI_RTSR_TR2|EXTI_RTSR_TR6|EXTI_RTSR_TR13;
		// EXTI->RTSR 			|= EXTI_RTSR_TR6;
		EXTI->RTSR 	 = EXTI_RTSR_TR3;
		
		// Falling trigger event configuration bit of line x
		//EXTI->FTSR 		= EXTI_FTSR_TR3 ;	// Failing trigger enabled
		
		// Interrupt mask register EXTI_IMR
		//EXTI->IMR 			=  EXTI_IMR_MR6 | EXTI_IMR_MR0;
		//EXTI->IMR  =  EXTI_IMR_MR3;		// Interrupt mask register EXTI_IMR
			EXTI->EMR  =  EXTI_EMR_MR3;		// Event mask register EXTI_IMR
		
	}

void SysTick_Handler(void)	{
		
		register uint32_t N;
		register int32_t n;
		
		//	disk_timerproc();
		//Timt += STCLK_LD;
		N = Timt + STCLK_LD; Timt = N;
		
		n = delay_us + STCLK_LD; delay_us = n;
		//n = Timer1; if (n) Timer1 = --n;
		//n = Timer2; if (n) Timer2 = --n;
		
		n = (Tim0 + STCLK_LD); Tim0 = n;
		n = (Tim1 + STCLK_LD); Tim1 = n;
		
		n = (trg0 + STCLK_LD); trg0 = n;
		n = (trg1 + STCLK_LD); trg1 = n;
		n = (trg2 + STCLK_LD); trg2 = n;
		n = (trg3 + STCLK_LD); trg3 = n;
		n = (trg4 + STCLK_LD); trg4 = n;
		n = (trg5 + STCLK_LD); trg5 = n;
		//LED1 ^= 1;
		
	}
__attribute__((interrupt)) void TIM2_IRQHandler(void)				{
		bTIM2_SR_UIF = 0;
		TIM2->SR = 0;
		
	}
__attribute__((interrupt)) void TIM3_IRQHandler(void)				{
		TIM3->SR = 0;
		register uint32_t N;
		register int32_t  n;
		
		N = Timt3     + TIM3_ARR; Timt3 = N;
		n = delay3_us + TIM3_ARR; delay3_us = n;
		//n = Timer1; if (n) Timer1 = --n;
		//n = Timer2; if (n) Timer2 = --n;
		
		n = (t3rg0 + TIM3_ARR); t3rg0 = n;
		n = (t3rg1 + TIM3_ARR); t3rg1 = n;
		n = (t3rg2 + TIM3_ARR); t3rg2 = n;
		
		//LED^=1;
		
	}
__attribute__((interrupt)) void EXTI0_IRQHandler(void)			{
		if(PB0_i){
			flag_9=1;
		}
		EXTI->PR   = EXTI_PR_PR0;				// Clear interupt request
	}
__attribute__((interrupt)) void EXTI1_IRQHandler(void)			{
		//bEXTI_PR_0 = 1;
		EXTI->PR   = EXTI_PR_PR1;				// Clear interupt request
		LED ^=1;
	}
__attribute__((interrupt)) void EXTI2_IRQHandler(void)			{
		bEXTI_PR_2 = 1;
		LED ^= 1;
	}
__attribute__((interrupt)) void EXTI3_IRQHandler(void)			{
		EXTI->PR   = EXTI_PR_PR3;				// Clear interupt request
		LED ^=1;
	}
__attribute__((interrupt)) void EXTI4_IRQHandler(void)			{
		EXTI->PR   = EXTI_PR_PR4;			
		LED ^= 1;
	}
__attribute__((interrupt)) void EXTI15_10_IRQHandler(void)	{
		if(bEXTI_PR_13) {
			bEXTI_PR_13 = 1;
			//LED2 = ~LED2;
		}
		
