pakosep/sepako/stm32f1_blue/doc/main.c
	}
__attribute__((interrupt)) void EXTI9_5_IRQHandler	 (void)	{
		if((bPBI_6 == 0)&&(EXTI->PR & EXTI_PR_PR6)) {			// check request PB6 touchpad
			//__disable_irq();
			//NVIC_DisableIRQ(EXTI9_5_IRQn);
			f1_tpirq   = 1;									// set IRQ_TP FLAG
			EXTI->PR   = EXTI_PR_PR6;				// Clear interupt request
			//bbEXTI_PR_6   = 1;
			//LED1 = ~LED1;								 	// debug
			EXTI->FTSR &= ~EXTI_FTSR_TR6;  	// Failing trigger disabled
			//bbEXTI_FTSR_6 	= 0;			
			//EXTI->FTSR 	 |= EXTI_FTSR_TR6;
		}
	}

__attribute__((interrupt)) void RTC_IRQHandler 	(void)			{
		// LED1 = ~LED1;
		// flag |= (1<<1);
		bRTC_CRL_SECF = 0;		//Clear Interrupt Flag bit
		f3_rtc_1sec = 1;
		while( bRTC_CRL_RTOFF == 0 );
	}
__attribute__((interrupt)) void RTCAlarm_IRQHandler(void){
		RTC->CRL &= ~(RTC_CRL_ALRF); // potrzebne do wakeup
		EXTI->PR |= EXTI_PR_PR17;
		//LED ^= 1;
		
	}
__attribute__((interrupt)) void DMA1_Channel1_IRQHandler(void){
		if(DMA1->ISR & DMA_ISR_GIF1){
			//DMA1->IFCR = DMA_IFCR_CGIF1 | DMA_IFCR_CTCIF1 | DMA_IFCR_CHTIF1;
			DMA1->IFCR =                  DMA_IFCR_CTCIF1;
			//ADC1_CR2_ADON  = 0;					// ADC1 STOP
			//DMA1_Ch1_EN_bb = 0;					// DMA1_CH1 STOP
			f7_dma1 = 1;
			LED1   ^= 1;
			//UaPutC('.');
		}
		
	}
__attribute__((interrupt)) void FSMC_IRQHandler	(void)			{
	;
}


//============================================================================
// Init Function
//============================================================================
void ADC1_DMA_Tim4_Init(void)		  {		
		//================ DMA Configuration =============================
		RCC->AHBENR   |= RCC_AHBENR_DMA1EN;					// enable clock for DMA1
		DMA1_Channel1->CCR  = 0;										// Disable channel
		//DMA1_Channel1->CMAR = (uint32_t)dma_buf;	// Destination address:
		DMA1_Channel1->CPAR = (uint32_t)&ADC1->DR;	// Source address:
		
		DMA1_Channel1->CCR =  DMA_CCR1_PL_0 | DMA_CCR1_MSIZE_0 | DMA_CCR1_PSIZE_0 | DMA_CCR1_TCIE 
		| DMA_CCR1_MINC | DMA_CCR1_CIRC;							
		//DMA1_Channel1->CCR |= DMA_CCR1_EN;				//DMA1_CH1 START
		
		
		//================= Timer_3 Configuration ==================================
		/*RCC->APB1ENR = RCC_APB1ENR_TIM3EN;
		TIM3->PSC = 100-1;
    TIM3->ARR = 120-1;
    //TIM3->EGR = TIM_EGR_UG;
    TIM3->CR2 = TIM_CR2_MMS_1; */
		//================= Timer_4 Configuration ==================================
		//GPIOB->CRH   |= (GPIOB->CRH & 0xfffffff0) | 0x00000000;	// PB9 out
		GPIOB->CRH   |= 0x00000090;	// PB9 out
		Delay_us(10);
		RCC->APB1ENR |= RCC_APB1ENR_TIM4EN;
		TIM4->PSC   = 100-1;
    TIM4->ARR   = 120-1;
    TIM4->CCR4  = 10;		//width pulse on PB9 out channel
		TIM4->CCMR1 = 0;
		TIM4->CCMR2 = TIM_CCMR2_OC4M_2 | TIM_CCMR2_OC4M_1;
		TIM4->CCER  = TIM_CCER_CC4E;
		//Delay_us(10);
		
		//================= ADC Configuration ====================================
		RCC->APB2ENR  |= RCC_APB2ENR_ADC1EN;			// enable clock for ADC1
		RCC->CFGR 		|= RCC_CFGR_ADCPRE_DIV4;  	// 2/4/6/8 str98
		GPIOA->CRL = (GPIOA->CRL & 0xffff0000);
		//ADC1->CR2 = ADC_CR2_ADON | ADC_CR2_JEXTTRIG | ADC_CR2_JEXTSEL_1; // TIM2
		
		ADC1->CR1 |= ADC_CR1_SCAN;	// multi channel mode
		ADC1->CR2 =  ADC_CR2_DMA | ADC_CR2_ADON | ADC_CR2_EXTTRIG | ADC_CR2_EXTSEL_2 | ADC_CR2_EXTSEL_0;
		Delay_us(1);
		//NVIC->ISER[0] |= NVIC_ISER_SETENA_18;
		
		//Kana³y czytane w odwrotnej kolejnoœci do parametru "sequence"
		ADC1->SQR1  = 0<<20;
		//ADC1->SQRx length and sequence (channel << sequence*5)
		//ADC1->SQR3  = 0<<3*5 | 3<<2*5 | 2<<1*5 | 1<<0*5;
		ADC1->SQR3  = 0<<1*5 | 1<<0*5 ;
		//ADC1->SMPRx sample time (cycles_time(0..7) << channel*3)
		ADC1->SMPR2 = 7<<0*3 | 7<<1*3 ;
		
		ADC1->CR2 |= ADC_CR2_RSTCAL;					// reset calibration
		while(ADC1->CR2 & ADC_CR2_RSTCAL);		// wait for reset
		ADC1->CR2 |= ADC_CR2_CAL;							// start calibration
		while(ADC1->CR2 & ADC_CR2_CAL);				// wait till calibration is done
		ADC1->CR2 |= ADC_CR2_ADON;						// start conversion
		while( !( ADC1->SR & ADC_SR_STRT ));
		
		//TIM4->CR1 = TIM_CR1_CEN | TIM_CR1_OPM;
		TIM3->CR1 = TIM_CR1_CEN;
		while( ! (ADC1->SR & ADC_SR_EOC) );
		
		
	}
void ADC1Init(void)				{
		
		RCC->APB2ENR   |= RCC_APB2ENR_ADC1EN;	// enable clock for ADC1
		RCC->CFGR 		 |= RCC_CFGR_ADCPRE_DIV4;  // 2/4/6/8 str98
		RCC_APB2RSTR_ADC1RST_bb = 1;		// Reset ADC1
		RCC_APB2RSTR_ADC1RST_bb = 0;
		
		///GPIOA->CRL = (GPIOA->CRL & 0xffffff00);
		//GPIOA->BSRR  =   0x1<<1+16;	// reset
		//GPIOA->BSRR  =   0x1<<1+0;		// set
		
		//ADC1->SQRx length and sequence (channel << sequence*5)
		///ADC1->SQR1 = ( 1<<20 	); 		//length and sequence 12..15 conversion 13-16 on channel	(0..17)
		//ADC1->SQR2 = ( 0<<0*5 ); 	//sequence 6..11 conversion (7..12) on channel (0..17)
		///ADC1->SQR3 = ( 0<<0*5 | 1<<1*5 );		//(channel<<sequence*5) sequence=0..5 conversions (1..6)  
		
		//ADC1->SMPRx sample time (cycles_time(0..7) << channel*3)
		///ADC1->SMPR2 = (4<<0*3 | 4<<1*3);
		///ADC1->CR1 = ADC_CR1_SCAN;			// multi channel mode
		//ADC1->CR2 |= ADC_CR2_CONT ;	// Continuous mode
		///ADC1->CR2 |= ADC_CR2_ADON ;		// On ADC
		
		/*
		ADC1->CR2 |= ADC_CR2_RSTCAL;					// reset calibration
		while(ADC1->CR2 & ADC_CR2_RSTCAL);		// wait for reset
		
		ADC1->CR2 |= ADC_CR2_CAL;							// start calibration
		while(ADC1->CR2 & ADC_CR2_CAL);				// wait till calibration is done
		
		ADC1->CR2 |= ADC_CR2_ADON;						// start conversion
		while( !( ADC1->SR & ADC_SR_STRT ));
		*/
		//while(!(ADC1->SR & ADC_SR_EOC));		// wait for the end of convertion
		//ADC1->DR;														// do the dummy read
		
	}
void ADC1DmaInit(void)		{
		
		#define ADC1_Cycle_Time 7			// Czas konwersji  0-7
		#define ADC1_Num_Seq 		4			// Liczba pomiarow 1-16
		
		//================ RCC Configuration =============================
		RCC->AHBENR  |= RCC_AHBENR_DMA1EN;				// enable clock for DMA1
		RCC->APB2ENR |= RCC_APB2ENR_ADC1EN;			// enable clock for ADC1
		RCC->CFGR 	 |= RCC_CFGR_ADCPRE_DIV2;  	// 2/4/6/8 str98
		
		//================ TIMER3 Configuration ==========================
		
		RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;
		TIM2->EGR = TIM_EGR_CC2G | TIM_EGR_TG;
		TIM2->CCMR1 &= ~TIM_CCMR1_CC2S;
		TIM2->CCMR1 |= TIM_CCMR1_OC2M_1 | TIM_CCMR1_OC2M_0;
		
		TIM2->CCER &= ~TIM_CCER_CC2P;
		TIM2->CCER |= TIM_CCER_CC2E;
		TIM2->CR2  |= TIM_CR2_MMS_1 | TIM_CR2_MMS_0;
		
		TIM2->CR1 = 0;
		TIM2->PSC = 60000-1;
		TIM2->CCR2= 0x0F;
		TIM2->ARR = 10000;
		TIM2->CR1 |= TIM_CR1_CEN;
		
		//================ DMA Configuration =============================
		uint32_t CCR_reg = 0;
		DMA1_Channel1->CCR = 0;											//Disable channel
		//DMA1_Channel1->CMAR = (uint32_t)dma_buf;	 	//Destination address:
		DMA1_Channel1->CPAR = (uint32_t)&ADC1->DR;		//Source address:
		
		//DMA1_Channel1->CNDTR = 4;									//Buffor size:
		CCR_reg |=  DMA_CCR1_PL_0;									//Priorytet medium
		CCR_reg |=  DMA_CCR1_MSIZE_0 | DMA_CCR1_PSIZE_0;	// 16bit/16bit
		//CCR_reg |=  DMA_CCR1_MSIZE_0;							//16bit/8bit
		CCR_reg |=  DMA_CCR1_MINC;									//Increment memory address enabled
		//CCR_reg |=  DMA_CCR1_PINC;								//Increment peripheral address disabled
		//CCR_reg |=  DMA_CCR1_CIRC;								//Mode Circular mode enabled
		CCR_reg |=  DMA_CCR1_TCIE;									//Transfer complete interrupt enable
		
