pakosep/sepako/stm32f1_blue/doc/main.c
		DMA1_Channel1->CCR =  CCR_reg;							
		//DMA1_Channel1->CCR |= DMA_CCR1_EN;				//DMA1_CH1 START
		NVIC_EnableIRQ(DMA1_Channel1_IRQn);				  // DMA1 Channel1
		
		//================ ADC Configuration =============================
		
		RCC_APB2RSTR_ADC1RST_bb = 1;							// Reset ADC1
		RCC_APB2RSTR_ADC1RST_bb = 0;
		
		GPIOA->CRL = (GPIOA->CRL & 0xffff0000);
		GPIOA->CRL = (GPIOA->CRL | 0x00000000);
		//ADC1->SQRx length and sequence (channel << sequence*5)
		ADC1->SQR1 = ( (ADC1_Num_Seq-1) << 20 ); 		//length and sequence chann 		 13-16
		//ADC1->SQR2 = ( 0<<0*5   ); 								//sequence conversion on channel 7-12
		ADC1->SQR3 =  (0<<0*5) | (1<<1*5) |(2<<2*5) | (3<<3*5) ;	//sequence conversion on channel 1-6
		//ADC1->SMPRx sample time (cycles_time << channel*3)
		ADC1->SMPR2 = (ADC1_Cycle_Time<<0*3) | (ADC1_Cycle_Time<<1*3) |	
		(ADC1_Cycle_Time<<2*3) | (ADC1_Cycle_Time<<3*3);
		ADC1->CR1  = ADC_CR1_SCAN;		// multiple channel				
		//ADC1->CR2 |= ADC_CR2_EXTTRIG|ADC_CR2_EXTSEL_0|ADC_CR2_EXTSEL_1|ADC_CR2_EXTSEL_2; //TIM2 triger
		//ADC1->CR2 |= ADC_CR2_CONT ;		//Continuous mode 
		//ADC1->CR2 |= ADC_CR2_DMA;			//DMA request on
		ADC1->CR2 |= ADC_CR2_DMA | ADC_CR2_CONT | ADC_CR2_EXTTRIG | ADC_CR2_EXTSEL_0
		| ADC_CR2_EXTSEL_1 | ADC_CR2_EXTSEL_2; //TIM2 triger
		
		if(!(ADC1->CR2 & ADC_CR2_ADON)) ADC1->CR2 |= ADC_CR2_ADON;
		
		ADC1->CR2 |= ADC_CR2_RSTCAL;				// reset calibration
		while(ADC1->CR2 & ADC_CR2_RSTCAL);	// wait for reset
		ADC1->CR2 |= ADC_CR2_CAL;						// start calibration
		while(ADC1->CR2 & ADC_CR2_CAL);			// wait till calibration is done
		
		ADC1->CR2 |= ADC_CR2_ADON;					// start conversion
		while( !( ADC1->SR & ADC_SR_STRT ));
		
	}
void DACDmaInit(void)			{
	RCC->APB1ENR  |= RCC_APB1ENR_DACEN;
	GPIOA->CRL   	&= 0xff00ffff;
	GPIOA->CRL   	|= 0x00dd0000;
	//DAC->CR				= DAC_CR_TSEL1|DAC_CR_TEN1|BOFF1;
	//DAC->CR				= DAC_CR_EN1|DAC_CR_EN2;
	DAC->CR				= DAC_CR_TEN1|DAC_CR_TEN2|DAC_CR_WAVE1|DAC_CR_WAVE2|DAC_CR_EN1|DAC_CR_EN2|
			DAC_CR_TSEL1_1|DAC_CR_TSEL2_1|(10<<24)|(10<<8);
	//DAC->DHR12R1	= 0;
	//DAC->DHR12R2	= 0;
	DAC->DHR12RD	= (0<<16) | 900;
	//DAC->SWTRIGR	= DAC_SWTRIGR_SWTRIG1|DAC_SWTRIGR_SWTRIG2;
}

void Usart1Init(void)			{
	RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
	GPIOA->CRH = (GPIOA->CRH & 0xfffff00f)| 0x00000490; //PA9=TX, PA10=RX zerowanie
	USART1->CR1 |= (USART_CR1_UE |USART_CR1_TE | USART_CR1_RE	|USART_CR1_RXNEIE);
	USART1->BRR = (F_CPU+115200/2)/115200;
	NVIC_EnableIRQ(USART1_IRQn);
}
void Usart2Init(void)			{
	RCC->APB1ENR |= RCC_APB1ENR_USART2EN;
	GPIOA->CRL = (GPIOA->CRL & 0xffff00ff)| 0x00004900; //PA2=TX, PA3=RX zerowanie
	USART2->CR1 |= (USART_CR1_UE |USART_CR1_TE | USART_CR1_RE	|USART_CR1_RXNEIE);
	USART2->BRR = ((F_CPU+115200/2)/115200)/2;
	NVIC_EnableIRQ(USART2_IRQn);
}
void Tim2PWMInit(void)		{
	RCC->APB1ENR |=(RCC_APB1ENR_TIM2EN); 	//w³¹czenie portu A oraz TIMERA2
	//GPIOA->CRL   = 0x444444AA; 						//ustawienie pir_dma_buf 0,1  portu A na wyjscie
	TIM2->CR1 	= 0x0000;	//Counter disabled			0x000
	TIM2->PSC 	= 0xffff;	//set prescaler				0x0ff
	TIM2->ARR 	= 0x00ff;	//set PWM reload count		0xfff
	TIM2->CCR1 	= 0x004f;	//set PWM start value 50%	0x07f
	TIM2->CCR2 	= 0x004f;	//set PWM start value 50%	0x07f
	TIM2->CCMR1 = 0x6868;	//set PWM mode on CH1,CH2	0x06868
	TIM2->CCER 	= 0x0011;	//enable CH1,CH2 output		0x101
	TIM2->DIER 	= 0x0000;	//enable update interrupt	0x000
	TIM2->DIER = TIM_DIER_UIE; 	// set interrupt
	TIM2->EGR 	= 0x0001;				// enable update		0x001
	//TIM2->CR1 	= (TIM_CR1_CEN | TIM_CR1_URS); 
	//w³¹cz. licznika i w³¹cz. generowania przerwañ tylko podczas prze³adowania licznika
	TIM2->CR1 	= 0x0001;	//Counter enabled			0x001
}
void Tim4Init(void)				{
	// Enable Peripheral Clock

	RCC->APB1ENR |= RCC_APB1ENR_TIM4EN;
	// De-init TIMER peripheral registers to their default reset values.
	RCC_APB1RSTR_TIM6RST_bb = 1;
	RCC_APB1RSTR_TIM6RST_bb = 0;

	// Clock Division = 0
	// Auto-Reload Preload = NOT buffered
	// Edge-Aligned mode
	// Direction = UP
	// One Pulse Mode = Off
	// Update Request can be anything
	// Update Event = Enabled
	// Counter Disabled (for r_dma_buf)
	TIM6->CR1 = 0;

	// Free-Running Period
	TIM6->ARR = 0xFFFFu;
	// Time-Base configuration - Scale to fixed Frequency of 1MHz
	// TIM6->PSC = (36000000 / TIMER_F_CPU) - 1;
	TIM6->PSC = (F_CPU/(10000000ul)) - 1;	// Resolution 0.1 us //36-1=1us
	// No Repetition Counter
	TIM6->RCR = 0;

	TIM6->DIER = TIM_DIER_UIE;
	// Force an update to load our ARR and Pre-Scalar shadow registers
	TIM6->EGR = TIM_EGR_UG;
	// Enable the Counter
	TIM6->CR1 |= TIM_CR1_CEN;

	NVIC_EnableIRQ(TIM6_IRQn);
}
void Tim3Init(void)				{
		// Timeout for EN28j60 Ethernet module
		
		RCC->APB1ENR |= RCC_APB1ENR_TIM3EN;
		// De-init TIMER peripheral registers to their default reset values.
		//RCC_APB1RSTR_TIM7RST_bb = 1;
		//RCC_APB1RSTR_TIM7RST_bb = 0;
		
		TIM3->CR1 = 0;
		TIM3->PSC = (F_CPU/(1000000)) - 1;
		TIM3->ARR = TIM3_ARR - 1;
		
		TIM3->DIER = TIM_DIER_UIE;
		TIM3->CR1  |= TIM_CR1_DIR;
		TIM3->CR1  |= TIM_CR1_CEN;
		NVIC_EnableIRQ(TIM3_IRQn);
		
	}
	
void SysTickInit(void)		{
	SysTick->LOAD = STCLK_LD - 1;    // 72/8/SysTick_LOAD interrupt every x s
	SysTick->CTRL = SysTick_CTRL_TICKINT|SysTick_CTRL_ENABLE; // enable SysTick
}

void I2C2_Init(void)				{
		
		GPIOB->CRH = (GPIOB->CRH & 0xffff00ff) | 0x0000ea00;	// PB10=SCL(Push-pull),PB11=SDA (Open-drain)
		RCC_APB1ENR_I2C2EN_bb = 1;         	// enable clock for I2C2 module
		I2C2_CR1_SWRST_bb = 1;            	// force software reset of I2C peripheral
		I2C2_CR1_SWRST_bb = 0;
		I2C2->TRISE = 37;               		// limit slope
		I2C2->CCR = 178;               			// setup speed (100kHz)
		I2C2->CR2 = I2C_CR2_FREQ_36MHz;     // config I2C2 module
		I2C2_CR1_PE_bb = 1;               	// enable peripheral
	}
void adc1_init_injected(uint32_t conversions,uint32_t channel)	{

#define 	ADC_CR2_JEXTSEL_JSWSTART  ADC_CR2_JEXTSEL
#define 	ADC_JSQR_JL_bit		20
#define 	ADC_JSQR_JSQ4_bit	15
#define 	ADC_JSQR_JSQ3_bit	10
#define 	ADC_JSQR_JSQ2_bit	5
#define 	ADC_JSQR_JSQ1_bit	0

	RCC->CFGR |= RCC_CFGR_ADCPRE_DIV2;		// divide the ADC clock by 6 -> f_SAMP = 0.85MHz
	RCC->APB2ENR   |= RCC_APB2ENR_ADC1EN;	// enable clock for ADC1
	//ADC1->SMPRx sample time (cycles_time_bit << channel*3)
	ADC1->SMPR2 = (0<<channel*3);

	ADC1->JSQR = ((conversions - 1) << ADC_JSQR_JL_bit) |	// configure desired number of conversions
			(channel << ADC_JSQR_JSQ4_bit) |
			(channel << ADC_JSQR_JSQ3_bit) |
			(channel << ADC_JSQR_JSQ2_bit) |
			(channel << ADC_JSQR_JSQ1_bit);
	// enable ADC, start calibration, enable external software trigger for Injected Group
	ADC1->CR2 = ADC_CR2_JEXTSEL_JSWSTART | ADC_CR2_JEXTTRIG | ADC_CR2_CAL | ADC_CR2_ADON;
	//ADC1->CR2 = ADC_CR2_CAL | ADC_CR2_ADON | ADC_CR2_CONT;
	ADC1_CR1_SCAN_bb = 1;									// enable scan mode (multi channel mode)

	ADC1_CR2_JSWSTART_bb = 1;						// start Injected Group
	while (ADC1_SR_JSTRT_bb == 0);			// wait for conversion to start
	//ADC1_SR_JSTRT_bb = 0;								// reset "Injected Group start of conversion" flag

	//if (channels & (ADC_INIT_CH16 | ADC_INIT_CH17))	// if temperature sensor or internal voltage regulator channels are selected...
	//ADC1_CR2_TSVREFE_bb = 1;						// ... enable them

	while (ADC1_CR2_CAL_bb == 1);					// wait for calibration end
}

uint32_t adc_get_internals(uint32_t avg_cycles)		{

