pakosep/sepako/stm32f1_blue/doc/main.c
	static volatile uint32_t * const jdrs[] = {&ADC1->JDR1, &ADC1->JDR2, &ADC1->JDR3, &ADC1->JDR4};
	uint32_t i, value = 0;

	ADC1_CR2_JSWSTART_bb = 1;						// start Injected Group
	while (ADC1_SR_JSTRT_bb == 0);			// wait for conversion to start
	ADC1_SR_JSTRT_bb = 0;								// reset "Injected Group start of conversion" flag
	while (ADC1_SR_JEOC_bb == 0);				// wait for conversions to end
	ADC1_SR_JEOC_bb = 0;								// reset "end of conversion" flag

	for (i = 0; i < avg_cycles; i++)		// accumulate desired number of samples
		value += *jdrs[i];

	if (avg_cycles > 1)									// should the samples be averaged?
	{
		//value += (avg_cycles / 2);				// yes - calculate the rounded average
		value /= avg_cycles;
	}

	return value;
}

uint32_t adc_get_injected(uint32_t avg_cycles)		{

	static volatile uint32_t * const jdrs[] = {&ADC1->JDR1, &ADC1->JDR2, &ADC1->JDR3, &ADC1->JDR4};
	uint32_t i, value = 0;

	ADC1_CR2_JSWSTART_bb = 1;
	while (ADC1_SR_JEOC_bb == 0);				// wait for conversions to end
	ADC1_SR_JEOC_bb = 0;								// reset "end of conversion" flag

	for (i = 0; i < avg_cycles; i++)		// accumulate desired number of samples
		value += *jdrs[i];

	if (avg_cycles > 1)									// should the samples be averaged?
	{
		//value += (avg_cycles / 2);				// yes - calculate the rounded average
		value /= avg_cycles;
	}

	return value;
}
void NVIC_conf(void)	{
#define AIRCR_VECTKEY_MASK   ((uint32_t)0x05FA0000)
	//---------------------------------------------------------
	SCB->AIRCR |= AIRCR_VECTKEY_MASK | (3<<8);      //[Optional] Define interrupt fielding group, PRIGROUP[1:0]=11. see: PM0056 Programming Manual, page 135
	//---------------------------------------------------------

	NVIC->IP[ADC1_2_IRQn]  = (2<<4);
	NVIC->IP[DMA1_Channel1_IRQn] = (1<<4);
	NVIC->IP[TIM1_CC_IRQn] = (0<<4);           //Set the highest priority for TIMER1, see: PM0056 Programming Manual, page 126
	//for IP[IQRn] see vector table in reference manual (position), Chapter: 9.Interrupts and events

	NVIC->ISER[0]= (1<<TIM1_CC_IRQn )|(1<<ADC1_2_IRQn)|(1<<DMA1_Channel1_IRQn);   //Enable interrupt for TIMER1 CC mode, see: PM0056 Programming Manual, page 121
}
//============================================================================
// Tools Function
//============================================================================
void I2C2_READ_REG( u08 adres, u08 reg_adres, u08 * dane, u08 len ) {
	//uint32_t dummy;
	I2C2->CR1 |= I2C_CR1_START;
	while( !( I2C2->SR1 & I2C_SR1_SB ));
	I2C2->DR = adres;
	while( !( I2C2->SR1 & I2C_SR1_ADDR ));
	//dummy = I2C2->SR2;
	while( !( I2C2->SR1 & I2C_SR1_TXE ));
	I2C2->DR = reg_adres;
	while( !( I2C2->SR1 & I2C_SR1_BTF ));
	I2C2->CR1 |= I2C_CR1_START;
	while( !( I2C2->SR1 & I2C_SR1_SB ));
	I2C2->DR = adres | 0x01;
	while( !( I2C2->SR1 & I2C_SR1_ADDR ));
	//dummy = I2C2->SR2;

	while( len )
	{
		if( len == 1 )
			I2C2->CR1 &= ~I2C_CR1_ACK;
		while( !( I2C2->SR1 & I2C_SR1_RXNE ));
		*( dane++ ) = I2C2->DR;
		len--;
	}
	I2C2->CR1 |= I2C_CR1_STOP;
}
void SetDate(void)	{
	char tbuf[16],u1buf[16];
	//Wprowadzanie pelnej daty i czasu
	UaPutS("\r\n rok = ");
	u16 yer = str2int((char *)u1buf);
	memset((char *)u1buf,0,16);
	UaPutS("\r\n mies = ");
	u08 mon = str2int((char *)u1buf);
	memset((char *)u1buf,0,16);
	UaPutS("\r\n dzien = ");
	u08 day = str2int((char *)u1buf);
	memset((char *)u1buf,0,16);
	UaPutS("\r\n gdz = ");
	u08 hor = str2int((char *)u1buf);
	memset((char *)u1buf,0,16);
	UaPutS("\r\n min = ");
	u08 min = str2int((char *)u1buf);
	memset((char *)u1buf,0,16);
	UaPutS("\r\n sek = ");
	u08 sec = str2int((char *)u1buf);
	memset((char *)u1buf,0,16);
	u32 Uxt = 1924984799;
	do{
		gmtime_r (&Uxt, &ptm);
		if(ptm.tm_year == yer) 	{
			if(ptm.tm_mon == mon) 	{
				if(ptm.tm_mday == day)  {
					if(ptm.tm_hour == hor)  {
						if(ptm.tm_min == min) 	{
							if(ptm.tm_sec == sec)		{
								gmtime_r (&Uxt, &ptm);
								UaPutS("\r\n ");
								UaPutS(uint2str(ptm.tm_year,tbuf));		UaPutC('-');
								UaPutS(uint2str(ptm.tm_mon,tbuf));		UaPutC('-');
								UaPutS(uint2str(ptm.tm_mday,tbuf));		UaPutC(' ');
								UaPutS(uint2str(ptm.tm_hour,tbuf));		UaPutC(':');
								UaPutS(uint2str(ptm.tm_min,tbuf));		UaPutC(':');
								UaPutS(uint2str(ptm.tm_sec,tbuf));		UaPutS("\r\n TimStmp = ");
								UaPutS(uint2str(Uxt,tbuf));
								break;
							} else Uxt --;
						}else Uxt -= 60;
					}else Uxt -= 3600;
				} else Uxt -= 86400;
			} else Uxt -= 86400;
		} else Uxt -= 86400;
	}
	while(Uxt);
}
void gmtime_r(const u32 *timer, struct tm *tmbuf)	{
	u32 time = *timer;
	u32 dayclock, dayno;
	int year = EPOCH_YR;

	dayclock = (u32) time % SECS_DAY;
	dayno = (u32) time / SECS_DAY;

	tmbuf->tm_sec = dayclock % 60;
	tmbuf->tm_min = (dayclock % 3600) / 60;
	tmbuf->tm_hour = dayclock / 3600;
	tmbuf->tm_wday = (dayno + 4) % 7; // Day 0 was a thursday
	while (dayno >= (u32) YEARSIZE(year))
	{
		dayno -= YEARSIZE(year);
		year++;
	}
	tmbuf->tm_year = year - YEAR0;
	tmbuf->tm_yday = dayno;
	tmbuf->tm_mon = 0;
	while (dayno >= (u32) _ytab[LEAPYEAR(year)][tmbuf->tm_mon])
	{
		dayno -= _ytab[LEAPYEAR(year)][tmbuf->tm_mon];
		tmbuf->tm_mon++;
	}
	tmbuf->tm_mday = dayno + 1;
	tmbuf->tm_isdst = 1;
	tmbuf->tm_hour += TIMEZONE - tmbuf->tm_isdst;
	tmbuf->tm_year += YEAR0;
	tmbuf->tm_mon  += 1;
	//  return tmbuf;
}




static void flash_latency(uint32_t frequency)
{
	uint32_t wait_states;

	if (frequency < 24000000ul)			// 0 wait states for core speed below 24MHz
		wait_states = 0;
	else if (frequency < 48000000ul)// 1 wait state for core 24MHz < speed >48MHz
		wait_states = 1;
	else									// 2 wait states for core speed over 48MHz
		wait_states = 2;

	FLASH->ACR |= wait_states;				// set the latency
}

//============================================================================
static void pll_start(uint32_t crystal, uint32_t frequency){
	uint32_t mul;
	
	mul = frequency / crystal;			// PLL multiplier calculation
	if (mul > 16)										// max PLL multiplier is 16
		mul = 16;

	RCC_CR_HSEON_bb = 1;						// enable HSE clock
	while (!RCC_CR_HSERDY_bb);			// wait for stable clock

	RCC->CFGR |= ((mul - 2)<<RCC_CFGR_PLLMUL_bit)|RCC_CFGR_PLLSRC|RCC_CFGR_PPRE1_DIV2;	
	// configuration of PLL: HSE x (mul), APB1 clk = /2
	RCC_CR_PLLON_bb = 1;						// enable PLL
	while (!RCC_CR_PLLRDY_bb);			// wait for PLL lock

	RCC->CFGR |= RCC_CFGR_SW_PLL;		// change SYSCLK to PLL
	while (((RCC->CFGR) & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL);	// wait for switch
}
static void rcc_init(void){
	RCC->APB2ENR = RCC_APB2ENR_IOPAEN | RCC_APB2ENR_IOPBEN | RCC_APB2ENR_IOPCEN | RCC_APB2ENR_AFIOEN;
	//RCC->APB2ENR = RCC_APB2ENR_IOPAEN | RCC_APB2ENR_AFIOEN;
	//RCC->APB2ENR   |= RCC_APB2ENR_AFIOEN;     	// enable clock for alternate function
}
/******************************************************************************
 * END OF FILE
 ******************************************************************************/
/* GPIO Configuration
GPIOx->CRL		PIN 0-7		
GPIOx->CRH		PIN 8-15

C1 C0 M1 M0		HEX
0	 0	0	 0		0x0		Input Analog 
0	 0	0	 1		0x1		Output Push-pull	10MHz
0	 0	1	 0		0x2		Output Push-pull	2MHz
0	 0	1	 1		0x3		Output Push-pull	50MHz

0	 1	0	 0		0x4		Input floating 
0	 1	0	 1		0x5		Output Open Drain	10MHz
0	 1	1	 0		0x6		Output Open Drain	2MHz
0	 1	1	 1		0x7		Output Open Drain	50MHz

1	 0	0	 0		0x8		Input  Pull Up/Down 
1	 0	0	 1		0x9		Output Alternate Push-pull	10MHz
1	 0	1	 0		0xA		Output Alternate Push-pull	2MHz
1	 0	1	 1		0xB		Output Alternate Push-pull	50MHz

1	 1	0	 0		0xC		Reserved 
1	 1	0	 1		0xD		Output Alternate Open-drain	10MHz
1	 1	1	 0		0xE		Output Alternate Open-drain	2MHz
1	 1	1	 1		0xF		Output Alternate Open-drain	50MHz
 */
